{
    "author": "ICGC",
    "totalPage": "20",
    "coverImageUrl": "assets/images/volume1.png",
    "title": "*nc[Name of Child]n* Naming Ceremony",
    "pages": [
        {
            "page_number": 10,
            "title": null,
            "content": "*b3.2*b *bCHILD NAMING CEREMONY: In the Home*b *b*b *b*b *bORDER OF SERVICE*b Opening Prayer Opening Remarks Songs of Praise/Hymn Declaration of Name(s) Naming of the Child Administration of Emblems Prayer (Blessing of the Child) Witnessing to the Name (attestation) Presentation of Gifts Word of Appreciation (Optional) Closing Prayer Benediction *b*b1.       Opening Prayer*b*b \n*tThe ceremony will commence with an opening prayer of thanksgiving to God.*t\n \n*tThe Officiating Minister will ask all gathered to stand.*t\n *bSample Prayer*b Our Lord from whom all blessings flow, we thank You for the gift of this child (a bundle of joy). As we begin this ceremony, we acknowledge Your presence. We appreciate *prYou for blessing [name of child’s parents] and taking care of*pr this child from conception to delivery. We ask that You bless and protect him/her from all childhood diseases and all forms of disasters and attacks. We also pray that the potential You have deposited in him/her will come to fruition so that he/ she will grow to be a pillar in this family, church and society. Thank You for answered prayer, in the Name of Jesus Christ. Amen. *b2.*b *bOpening Remarks*b \n*tThe Officiating Minister welcomes the people present and briefly states the*t\n \n*timportance of the naming ceremony. He/she shall say:*t\n "
        },
        {
            "page_number": 11,
            "title": null,
            "content": "A child is a gift from God. Once a child is born, he/she becomes a member of a family, and the community. It is therefore important to formally welcome and introduce the newly born child to the existing members of the society. The naming ceremony is conducted to formally welcome a newly born child into the family and community. It is also an occasion for the parents to publicly announce the name(s) of the child. Names play a very important role in the life of an individual. It has spiritual and social influences on a person. It also sets apart a person from others and their purpose in life. For example, the announcement of the name of Jesus in *bMatthew*b *b1:21*b helps us to understand the mission of Jesus as the Saviour of the world. Parents should, therefore, prayerfully consider the names they choose for their children. *b3.*b *bSongs of Praise/Hymn*b \n*tThe Officiating Minister shall ask those present to rise and sing songs of praise*t\n \n*tfor a maximum duration of five (5) minutes.*t\n *b4.*b *bDeclaration of Name(s)*b \n*tThe Officiating Minister shall ask the father to stand and face the congregation.*t\n The Officiating Minster shall then address the father as follows: *bOfficiating Minister:*b \n*t*fn[Name of father]*fn*t\n do you have a name for your child? *bFather:*b I do. *bOfficiating Minister:*b In the presence of God and this gathering, please, state the names of your child and explain their meanings. *bFather:*b Ladies and gentlemen, after much prayer the mother and I have chosen the following names for our child: \n*t[The father then announces the*t\n \n*tnames to those present and explains the meaning of the names].*t\n \n*tThe Officiating Minister then leads the witnesses to repeat the child’s name*t\n \n*tthrice.*t\n 2 Where there is more than one child to be named, such as in the case of twins, triplets, etc. the Officiating Minister shall receive and name each child in turn. "
        },
        {
            "page_number": 12,
            "title": null,
            "content": "*b5.*b *bNaming of the Child*b  \n*ba. \tPrayer over the Name(s)*b\n \n*t*t\n \n*tThe Officiating Minister shall pray over the names of the child.*t\n *bSample Prayer*b Our Heavenly Father, we continue to thank You on this special occasion and for the gift of this child. I commit to You *ncthe names [Names of the Child] chosen by his/her parents,*nc and ask that You sanctify these names to be a blessing for this child, in the name of Jesus. Amen. \n*bb.\t Conferment of Name(s)*b\n \n*tThe father hands over the child to the Officiating Minister who receives*t\n \n*tthe child into his/her arms.*t\n \n*t2*t\n \n*t*t\n \n*tThe Officiating Minister shall confer the name(s) upon the child as follows:*t\n *ncI hereby confer the name [name of the child] upon you in the*nc name of the Father, the Son and the Holy Spirit. I declare that this name \n*t*nc[name of the child]*nc*t\n shall be a blessing to you all the days of your life, in the name of Jesus Christ. Amen. *b6.*b *bAdministration of Emblems*b \n*tAt this point the emblems will be uncovered and made ready to be administered.*t\n *bThe Officiating Minister shall say:*b Symbols are part of our Christian ceremonies. We use bread and wine as symbols of Jesus’ Body and Blood, respectively. Also, we view the dove as a symbol representing the Holy Spirit. In this ceremony, water, salt, and honey will be used symbolically. \n*ba.\t Prayer Over the Emblems*b\n \n*tThe Officiating Minister then prays over the emblems.*t\n *bSample Prayer*b Heavenly Father, Creator of all things, we present these emblems to you to sanctify them and make them fit for our use, in the name of our Lord and Saviour Jesus Christ. Amen. "
        },
        {
            "page_number": 13,
            "title": null,
            "content": "\n*tThe Officiating Minister will administer the emblems to the child in the following*t\n \n*torder:*t\n \n*t*bWater, salt and honey,*b*t\n \n*texplaining their significance as he does so.*t\n \n*bb.\t Administration of the Water*b\n \n*tThe Minister shall address the gathering as follows:*t\n This is water. It represents Life, Purity and the Word of God [as he (she) lifts up the water in the view of the gathering and then places it back in the tray]. In *bJohn 7:37-39,*b Jesus likened water to life, saying: “. . . If anyone thirsts, let him come to Me and drink. He who believes in Me, as the Scripture has said, out of his heart will flow rivers of living water.” Water also symbolises the Word of God and its importance to life. In *bEphesians 5:26*b the Scriptures state that God sanctifies and cleanses us with the washing of water by His Word. In the same way, this child shall be purified by the Word of God. \n*tThe Officiating Minister then fetches a little water with a teaspoon, places a*t\n \n*tdrop on the tongue of the child, mentions his/her name, and says:*t\n *nc[Name of child], let the Word of God dwell richly in your life*nc in all wisdom when you come of age and accept Christ as your Lord and Saviour. The Word of God shall set you apart in purity and it shall be a light for your path and a lamp unto your feet. The promises of God in His Word will manifest in your life and make you exceedingly fruitful, in the name of Jesus. Amen. \n*bc.\t Administration of Salt*b\n \n*tThe Officiating Minister shall administer the second emblem (salt).*t\n \n*tHe/she shall say:*t\n This is salt. It represents character, preservation and influence (as he/she lifts up the salt in the view of the gathering and then places it back on the tray). "
        },
        {
            "page_number": 14,
            "title": null,
            "content": "Matthew 5:13 declares:  “You are the salt of the earth; but if the salt loses its flavour, how shall it be seasoned? It is then good for nothing but to be thrown out and trampled underfoot by men”. Jesus likened the believer to the salt of the earth. Salt is a preservative, so believers are to preserve the earth from corruption.  Salt also gives flavour and has medicinal value. *ncAs salt is a powerful influence so we trust that [name of child]*nc will also grow to preserve his/her family, church, society and the world from corruption. \n*tThe Officiating Minister takes a granule of salt with the teaspoon, places it on*t\n \n*tthe tongue of the child and says:*t\n *nc[Name of child], you shall be salt to your generation to*nc preserve righteousness. Just as salt is a preservative so shall your life be preserved from sicknesses, negative influences and all forms of evil. As salt of the earth you will influence your generation through your life, conduct and good deeds, in the name of Jesus. Amen. \n*bd.\t Administration of Honey*b\n \n*tThe officiating minister shall administer the third emblem (honey) and*t\n \n*tshall say:*t\n This is honey. It represents wisdom, industry and blessing (as he/she lifts up the plate or cup of honey in the view of the gathering and then places it back on the tray). *bProverbs 24:13-14*b reads: “My child, eat honey because it is good, and the honeycomb which is sweet to your taste; So shall the knowledge of wisdom be to your soul; If you have found it, there is a prospect, And your hope will not be cut off.” God created the bee with the natural endowment of wisdom and industry to produce honey. Honey is very sweet and symbolic of wisdom. God has created and blessed us with natural abilities, gifts and talents to be productive. *ncWe believe that [Name of Child] is also created with his/her*nc own natural abilities and talents which make him/her unique. "
        },
        {
            "page_number": 15,
            "title": null,
            "content": "With the help of God, he/she must effectively use his/her gifts and talents for the development of himself/herself, the family, the church and the world. This child will be a child of wisdom. He/she will be discreet, industrious, and excellent. He/she shall demonstrate a sweet spirit. \n*tThe Officiating Minister takes a small portion of honey with a teaspoon and*t\n \n*tplaces it on the child’s tongue, mentions his/her name and says:*t\n *nc[Name of child], today we ask you to love and seek wisdom*nc from God, and exhibit a sweet spirit in your relationship with everyone all the days of your life. You will be industrious and accomplish great feats in life. The blessings of God will be upon you all the days of your life, in the name of Jesus. Amen. *b*b7.      Prayer (Blessing of the Child)*b*b \n*tAfter the child has been named, the Officiating Minister will pray for him/her.*t\n \n*tIn the case of more than one child, the Officiating Minister will pray for them*t\n \n*twhile they are held in the arms of their parents.*t\n \n*tThe Officiating Minister, (with the child in his/her arms) prays for the child,*t\n \n*tparents and those present, in that order.*t\n *bSample Prayer*b God of all creation and giver of all good and prefect gifts, *ncwe thank You for the life of [name of child]. We ask that You*nc protect, preserve, and watch over him/her all the days of his/ her life. May You guide his/her footsteps, inspire his/her mind and anoint his/her hands. We pray that You will provide for his/her physical and spiritual needs as he/she grows before You. *ncWhen [name of child] comes of age may he/she understand*nc the gospel and receive Jesus Christ as his/her Lord and Saviour. May You build your strength into him/her, shape his/her character with Your spirit and Word. Give him/her an unshakable sense of your purpose for his/her life and protect your plans for him/her. "
        },
        {
            "page_number": 16,
            "title": null,
            "content": "*nc[Name of child], I declare that you will fulfill your purpose*nc on earth and influence your generation. The Lord will make you wiser than your age and grant you good success in your educational pursuit. You will be exceedingly fruitful in life and prosper in the work of your hands. I declare the favour of God to rest upon you and continually make a way for you. We ask this in the name of Jesus Christ. Amen. *b*b8.       Witnessing to the Name (Attestation)*b*b \n*tWitnessing to the name (attestation) by the witnesses could be done as follows:*t\n *bOption 1:*b \n*tAll witnesses tasting the honey and making a declaration together.*t\n \n*tBy this, each guest at the ceremony will attest to being a witness to*t\n \n*tthe ceremony by tasting the honey and making a declaration.*t\n \n*tThe Officiating Minister shall lead the gathering to make the*t\n \n*tdeclaration as follows:*t\n *bSample Declaration*b *nc[Name of child], we welcome you wholeheartedly to this*nc world. You will do the will of God and receive Jesus Christ as your Lord and Saviour when you come of age. Live to accomplish your purpose and become a blessing to your generation, in the name of Jesus Christ. Amen. *bOption 2:*b \n*tRepresentatives of clergy, family and church will taste the honey on*t\n \n*tbehalf of the gathering and make a declaration together. (This option*t\n \n*tis recommended where the gathering is large).*t\n \n*tThe Officiating Minister shall lead the said representatives to*t\n \n*tdeclare as follows:*t\n *bSample Declaration*b *nc[Name of child], we welcome you wholeheartedly to this*nc world. You will do the will of God and receive Jesus Christ as your Lord and Saviour when you come of age. Live to accomplish your purpose and become a blessing to your generation, in the name of Jesus Christ. Amen. "
        },
        {
            "page_number": 17,
            "title": null,
            "content": "*bOption 3:*b \n*tWhere the gathering shall make a declaration without tasting the*t\n \n*thoney.*t\n \n*tThe Officiating Minister shall lead the people gathered to make the*t\n \n*tdeclaration as follows:*t\n *bSample Declaration*b \n*t*nc[Name of child], we welcome you wholeheartedly to this world. You*nc*t\n \n*twill do the will of God and receive Jesus Christ as your Lord and*t\n \n*tSaviour when you come of age. Live to accomplish your purpose and*t\n \n*tbecome a blessing to your generation, in the name of Jesus Christ.*t\n \n*tAmen.*t\n *b*b9.      Presentation of Gifts*b*b \n*tThe Officiating Minister shall say:*t\n *bIn Matthew 2:11*b Wise men travelled from the east and presented special gifts of gold, frankincense and myrrh to the baby Jesus. In the same way we encourage friends, family and loved ones gathered here to also present gifts to [name of child].  \n*tThe Minister will invite parents, family and friends who have gifts to present*t\n \n*tthem to the child.*t\n *b*b10.     Word of Appreciation (Optional)*b*b If the parents of the child so desire they may be invited by the Officiating Minister to say a few words of appreciation to all present. (This must be discussed and agreed to before the ceremony commences). *b*b11.    Closing Prayer*b*b \n*tThe Officiating Minister will say the closing prayer to end the ceremony.*t\n *bSample Prayer*b Thank You, Lord for Your presence with us from the beginning of this ceremony to the end. We ask that You empower the parents, Mr. and Mrs. [last name of parents] with the resources they would need to take care of this child as they instruct and guide him/her in Your Way. "
        },
        {
            "page_number": 18,
            "title": null,
            "content": "*ncLord, bless and sanctify these gifts given to [name of child].*nc May all who gave receive increase according to Your Word which says, “give and it shall be given back unto you; a good measure, pressed down, shaken together and running over, will be poured into your bosom ” (Luke 6:38). As we depart, we ask that Your grace will continue to be with us. Grant us travelling mercies to our various destinations. May Your peace and joy abide in this house, in the Name of our Lord Jesus Christ. Amen. *b12.*b *bBenediction*b \n*tThe officiating Minister shall pronounce the benediction.*t\n *bSample Benediction*b May the glory of the LORD endure forever; may the LORD rejoice in His works. Now, may the grace of our Lord Jesus Christ, the Love of God and the fellowship of the Holy Spirit be with us all. Amen. "
        }
    ]
}