[
    {
        "page_number": 1,
        "title": null,
        "content": ""
    },
    {
        "page_number": 2,
        "title": null,
        "content": "*bINTERNATIONAL CENTRAL GOSPEL CHURCH*b MINISTERS’ MANUAL *bVOLUME ONE (1)*b *bChild Naming &*b *bDedication Ceremonies*b *bRite of Passages*b "
    },
    {
        "page_number": 3,
        "title": null,
        "content": ""
    },
    {
        "page_number": 4,
        "title": "TABLE OF CONTENTS",
        "content": "TABLE OF CONTENTS *b*b1.  INTRODUCTION*b*b *b*b *b*b *b*b *b*b *b*b *b*b *b2*b *b*b2.  GLOSSARY*b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b3*b *b*b *b*b3.  CHILD NAMING CEREMONY*b*b *b*b *b*b *b*b *b*b *b4*b 3.1 GUIDELINES      4 3.2 CHILD NAMING CEREMONY: In the Home 7 3.3 CHILD DEDICATION CEREMONY   16 3.3.1 GUIDELINES      16 3.4.2 CHILD DEDICATION CEREMONY:   19   Service Devoted Entirely for Child Dedication 3.5. NAMING & DEDICATION OF CHILD: In Church      26 3.5.1 GUIDELINES      26 3.5.2 PART 1: CHILD NAMING CEREMONY  27 3.5.3 PART 2: CHILD DEDICATION CEREMONY  34 *b*b4.  RITES OF PASSAGE: CHILDREN AND YOUTH CHURCH*b*b *b39*b *b*b 4.1 GENERAL GUIDELINES    39 4.2 PURITY SERVICE     44 4.3 SANCTIFICATION SERVICE    49 *b*b5.  FORMS*b*b   5.1 CHILD NAMING CEREMONY – REQUEST FORM    54 5.2 CHILD DEDICATION – REQUEST FORM                    57  *b*b6.  BENEDICTION SCRIPTURES*b*b "
    },
    {
        "page_number": 5,
        "title": "1.    INTRODUCTION",
        "content": "This Ministers Manual (Volume 1) outlines Naming and Dedication Cer- emonies; and Rites of Passage: Children and Youth Church as practiced by the International Central Gospel Church (ICGC). It presents a step-by-step approach by which pastors should conduct such ceremonies. The Manual takes into consideration the theological position and biblical principles as practiced in the ministry of the Church. This Manual serves as a practical guide and resource for the minister. It provides the standard for excellence and order in pastoral duties. The scripture enjoins us in 1 Corinthians 14: 40 that we should “Let all things be done decently and in order.” It is our prayer that this Manual will enrich the ministry of the pastor and the Church and be a blessing to all people. *b*b1.    INTRODUCTION*b*b "
    },
    {
        "page_number": 6,
        "title": "2.    GLOSSARY",
        "content": "*b1.\t Words importing male persons include female persons (except where*b otherwise and clearly stated).   *bNB:*b The word ‘they’ would be used to refer to he/she in the singular and plural form. *b3. Unless otherwise identified, scripture quotations are from the New*b King James Version (NKJV). *b*b2.    GLOSSARY*b*b "
    },
    {
        "page_number": 7,
        "title": "3.    CHILD NAMING CEREMONY",
        "content": "*b3.1*b *bGUIDELINES*b *b1.*b *bIntroduction*b The purpose of a naming ceremony is to celebrate the arrival of a child, welcome him/her into the family and society, and introduce him/her to the world. The ceremony also gives the child an identity by conferring upon him/her names chosen by the parents or guardian. Names play a very important role in the life of an individual. A name sets apart a person from others and their purpose in life. For example, the announcement of the name “Jesus” in Matthew 1:21 helps us to understand the mission of Jesus Christ as the Savior of the world. Parents must therefore be advised to prayerfully choose names that shall be a blessing to their child. *b2.*b *bGeneral Guidelines*b The child naming ceremony is a momentous occasion, which presents an opportunity to celebrate the goodness and faithfulness of God. The Officiating Minister shall be guided by the following: \na. The Officiating Minister\n 1 should prepare adequately to officiate with a team including an assistant (e.g. a church leader), a chorus leader, ushers, etc. \nb.\t The program should be discussed with the parents before the\n celebration so that there would be an understanding by all parties of what to expect. \nc.\t The name of the child should be printed on paper in bold fonts and\n presented to the Officiating Minister upon his/her arrival. \nd. The following emblems (in small quantities) shall be used\n symbolically during the ceremony: *b*b3.    CHILD NAMING CEREMONY*b*b 1 He/she may be a leader of the church so delegated. "
    },
    {
        "page_number": 8,
        "title": null,
        "content": "\ni. Water, which symbolises life, purity and the Word of God\n ii. Salt, which symbolises character, preservation and influence. iii.  Honey, which symbolises wisdom, industry and blessing. \ne.\t The emblems should be in separate vessels as follows:\n \ni.\t Water should be in a clean small glass.\n ii.\t Granulated salt in a small saucer. iii.\tHoney in a small saucer. \nf.\t Other Items  needed:\n \ni.\t A teaspoon\n ii.\t Tissue paper or wipes \n*tAll of the above should be set in a tray and covered with a serviette.*t\n *bNB:*b Honey could be provided with disposable teaspoons for use by those present. This is optional. *b3.*b *bAdditional Guidelines*b Aside from the general guidelines above, the Officiating Minister shall be guided by the following additional guidelines which are specific to particular options: *ba.*b *bNaming Ceremony at Home*b For this option: \ni.\t The emblems shall be provided by the parents.\n ii.\t The tray with the emblems should be set on a center or side-table close to the Officiating Minister. iii. The Officiating Minister will sit facing the gathering. The father of the child shall sit next to the officiating minister, with the mother of the child sitting next to the father. iv.\tThe maximum duration recommended for conducting this ceremony is 45 minutes. *bb.*b *bNaming Ceremony in the Church*b For this option: \ni. Seats should be reserved for the parents, preferably at the front row.\n "
    },
    {
        "page_number": 9,
        "title": null,
        "content": "Seats may also be reserved for grandparents and other dignitaries who may be present. ii.\t There should be musical prelude while guests take their seats. It should be quiet music that sets the tone for the service. It could be the organist softly playing musical pieces. iii.\tOn duty should be a team of ushers to direct guests to their seats and to maintain order. Other volunteers required should comprise a praise and worship leader, a sound technician and a church leader to assist the Officiating Minister. iv.\tThe tray with the emblems should be set on a well-polished table which should be placed at a convenient place on the stage. \nv.\t The emblems shall be provided by the church.\n vi.\tA gift table may be set at a space designated by the church for those who have gifts for the child. \n*bc.      Naming and Dedication of Child in the Church*b\n For this option, the naming and dedication of the child  are done together. This option is used when the naming ceremony is held in the church. The maximum time recommended for conducting this ceremony is one (1) hour. "
    },
    {
        "page_number": 10,
        "title": null,
        "content": "*b3.2*b *bCHILD NAMING CEREMONY: In the Home*b *b*b *b*b *bORDER OF SERVICE*b Opening Prayer Opening Remarks Songs of Praise/Hymn Declaration of Name(s) Naming of the Child Administration of Emblems Prayer (Blessing of the Child) Witnessing to the Name (attestation) Presentation of Gifts Word of Appreciation (Optional) Closing Prayer Benediction *b*b1.       Opening Prayer*b*b \n*tThe ceremony will commence with an opening prayer of thanksgiving to God.*t\n \n*tThe Officiating Minister will ask all gathered to stand.*t\n *bPrayer*b Our Lord from whom all blessings flow, we thank You for the gift of this child (a bundle of joy). As we begin this ceremony, we acknowledge Your presence. We appreciate *prYou for blessing [name of child’s parents] and taking care of*pr this child from conception to delivery. We ask that You bless and protect him/her from all childhood diseases and all forms of disasters and attacks. We also pray that the potential You have deposited in him/her will come to fruition so that he/ she will grow to be a pillar in this family, church and society. Thank You for answered prayer, in the Name of Jesus Christ. Amen. *b2.*b *bOpening Remarks*b \n*tThe Officiating Minister welcomes the people present and briefly states the*t\n \n*timportance of the naming ceremony. He/she shall say:*t\n "
    },
    {
        "page_number": 11,
        "title": null,
        "content": "A child is a gift from God. Once a child is born, he/she becomes a member of a family, and the community. It is therefore important to formally welcome and introduce the newly born child to the existing members of the society. The naming ceremony is conducted to formally welcome a newly born child into the family and community. It is also an occasion for the parents to publicly announce the name(s) of the child. Names play a very important role in the life of an individual. It has spiritual and social influences on a person. It also sets apart a person from others and their purpose in life. For example, the announcement of the name of Jesus in *bMatthew*b *b1:21*b helps us to understand the mission of Jesus as the Saviour of the world. Parents should, therefore, prayerfully consider the names they choose for their children. *b3.*b *bSongs of Praise/Hymn*b \n*tThe Officiating Minister shall ask those present to rise and sing songs of praise*t\n \n*tfor a maximum duration of five (5) minutes.*t\n *b4.*b *bDeclaration of Name(s)*b \n*tThe Officiating Minister shall ask the father to stand and face the congregation.*t\n The Officiating Minster shall then address the father as follows: *bOfficiating Minister:*b \n*t*fn[Name of father]*fn*t\n do you have a name for your child? *bFather:*b I do. *bOfficiating Minister:*b In the presence of God and this gathering, please, state the names of your child and explain their meanings. *bFather:*b Ladies and gentlemen, after much prayer the mother and I have chosen the following names for our child: \n*t[The father then announces the*t\n \n*tnames to those present and explains the meaning of the names].*t\n \n*tThe Officiating Minister then leads the witnesses to repeat the child’s name*t\n \n*tthrice.*t\n 2 Where there is more than one child to be named, such as in the case of twins, triplets, etc. the Officiating Minister shall receive and name each child in turn. "
    },
    {
        "page_number": 12,
        "title": null,
        "content": "*b5.*b *bNaming of the Child*b  \n*ba. \tPrayer over the Name(s)*b\n \n*t*t\n \n*tThe Officiating Minister shall pray over the names of the child.*t\n *bPrayer*b Our Heavenly Father, we continue to thank You on this special occasion and for the gift of this child. I commit to You *ncthe names [Names of the Child] chosen by his/her parents,*nc and ask that You sanctify these names to be a blessing for this child, in the name of Jesus. Amen. \n*bb.\t Conferment of Name(s)*b\n \n*tThe father hands over the child to the Officiating Minister who receives*t\n \n*tthe child into his/her arms.*t\n \n*t2*t\n \n*t*t\n \n*tThe Officiating Minister shall confer the name(s) upon the child as follows:*t\n *ncI hereby confer the name [name of the child] upon you in the*nc name of the Father, the Son and the Holy Spirit. I declare that this name \n*t*nc[name of the child]*nc*t\n shall be a blessing to you all the days of your life, in the name of Jesus Christ. Amen. *b6.*b *bAdministration of Emblems*b \n*tAt this point the emblems will be uncovered and made ready to be administered.*t\n *bThe Officiating Minister shall say:*b Symbols are part of our Christian ceremonies. We use bread and wine as symbols of Jesus’ Body and Blood, respectively. Also, we view the dove as a symbol representing the Holy Spirit. In this ceremony, water, salt, and honey will be used symbolically. \n*ba.\t Prayer Over the Emblems*b\n \n*tThe Officiating Minister then prays over the emblems.*t\n *bPrayer*b Heavenly Father, Creator of all things, we present these emblems to you to sanctify them and make them fit for our use, in the name of our Lord and Saviour Jesus Christ. Amen. "
    },
    {
        "page_number": 13,
        "title": null,
        "content": "\n*tThe Officiating Minister will administer the emblems to the child in the following*t\n \n*torder:*t\n \n*t*bWater, salt and honey,*b*t\n \n*texplaining their significance as he does so.*t\n \n*bb.\t Administration of the Water*b\n \n*tThe Minister shall address the gathering as follows:*t\n This is water. It represents Life, Purity and the Word of God [as he (she) lifts up the water in the view of the gathering and then places it back in the tray]. In *bJohn 7:37-39,*b Jesus likened water to life, saying: “. . . If anyone thirsts, let him come to Me and drink. He who believes in Me, as the Scripture has said, out of his heart will flow rivers of living water.” Water also symbolises the Word of God and its importance to life. In *bEphesians 5:26*b the Scriptures state that God sanctifies and cleanses us with the washing of water by His Word. In the same way, this child shall be purified by the Word of God. \n*tThe Officiating Minister then fetches a little water with a teaspoon, places a*t\n \n*tdrop on the tongue of the child, mentions his/her name, and says:*t\n *nc[Name of child], let the Word of God dwell richly in your life*nc in all wisdom when you come of age and accept Christ as your Lord and Saviour. The Word of God shall set you apart in purity and it shall be a light for your path and a lamp unto your feet. The promises of God in His Word will manifest in your life and make you exceedingly fruitful, in the name of Jesus. Amen. \n*bc.\t Administration of Salt*b\n \n*tThe Officiating Minister shall administer the second emblem (salt).*t\n \n*tHe/she shall say:*t\n This is salt. It represents character, preservation and influence (as he/she lifts up the salt in the view of the gathering and then places it back on the tray). "
    },
    {
        "page_number": 14,
        "title": null,
        "content": "Matthew 5:13 declares:  “You are the salt of the earth; but if the salt loses its flavour, how shall it be seasoned? It is then good for nothing but to be thrown out and trampled underfoot by men”. Jesus likened the believer to the salt of the earth. Salt is a preservative, so believers are to preserve the earth from corruption.  Salt also gives flavour and has medicinal value. *ncAs salt is a powerful influence so we trust that [name of child]*nc will also grow to preserve his/her family, church, society and the world from corruption. \n*tThe Officiating Minister takes a granule of salt with the teaspoon, places it on*t\n \n*tthe tongue of the child and says:*t\n *nc[Name of child], you shall be salt to your generation to*nc preserve righteousness. Just as salt is a preservative so shall your life be preserved from sicknesses, negative influences and all forms of evil. As salt of the earth you will influence your generation through your life, conduct and good deeds, in the name of Jesus. Amen. \n*bd.\t Administration of Honey*b\n \n*tThe officiating minister shall administer the third emblem (honey) and*t\n \n*tshall say:*t\n This is honey. It represents wisdom, industry and blessing (as he/she lifts up the plate or cup of honey in the view of the gathering and then places it back on the tray). *bProverbs 24:13-14*b reads: “My child, eat honey because it is good, and the honeycomb which is sweet to your taste; So shall the knowledge of wisdom be to your soul; If you have found it, there is a prospect, And your hope will not be cut off.” God created the bee with the natural endowment of wisdom and industry to produce honey. Honey is very sweet and symbolic of wisdom. God has created and blessed us with natural abilities, gifts and talents to be productive. *ncWe believe that [Name of Child] is also created with his/her*nc own natural abilities and talents which make him/her unique. "
    },
    {
        "page_number": 15,
        "title": null,
        "content": "With the help of God, he/she must effectively use his/her gifts and talents for the development of himself/herself, the family, the church and the world. This child will be a child of wisdom. He/she will be discreet, industrious, and excellent. He/she shall demonstrate a sweet spirit. \n*tThe Officiating Minister takes a small portion of honey with a teaspoon and*t\n \n*tplaces it on the child’s tongue, mentions his/her name and says:*t\n *nc[Name of child], today we ask you to love and seek wisdom*nc from God, and exhibit a sweet spirit in your relationship with everyone all the days of your life. You will be industrious and accomplish great feats in life. The blessings of God will be upon you all the days of your life, in the name of Jesus. Amen. *b*b7.      Prayer (Blessing of the Child)*b*b \n*tAfter the child has been named, the Officiating Minister will pray for him/her.*t\n \n*tIn the case of more than one child, the Officiating Minister will pray for them*t\n \n*twhile they are held in the arms of their parents.*t\n \n*tThe Officiating Minister, (with the child in his/her arms) prays for the child,*t\n \n*tparents and those present, in that order.*t\n *bPrayer*b God of all creation and giver of all good and prefect gifts, *ncwe thank You for the life of [name of child]. We ask that You*nc protect, preserve, and watch over him/her all the days of his/ her life. May You guide his/her footsteps, inspire his/her mind and anoint his/her hands. We pray that You will provide for his/her physical and spiritual needs as he/she grows before You. *ncWhen [name of child] comes of age may he/she understand*nc the gospel and receive Jesus Christ as his/her Lord and Saviour. May You build your strength into him/her, shape his/her character with Your spirit and Word. Give him/her an unshakable sense of your purpose for his/her life and protect your plans for him/her. "
    },
    {
        "page_number": 16,
        "title": null,
        "content": "*nc[Name of child], I declare that you will fulfill your purpose*nc on earth and influence your generation. The Lord will make you wiser than your age and grant you good success in your educational pursuit. You will be exceedingly fruitful in life and prosper in the work of your hands. I declare the favour of God to rest upon you and continually make a way for you. We ask this in the name of Jesus Christ. Amen. *b*b8.       Witnessing to the Name (Attestation)*b*b \n*tWitnessing to the name (attestation) by the witnesses could be done as follows:*t\n *bOption 1:*b \n*tAll witnesses tasting the honey and making a declaration together.*t\n \n*tBy this, each guest at the ceremony will attest to being a witness to*t\n \n*tthe ceremony by tasting the honey and making a declaration.*t\n \n*tThe Officiating Minister shall lead the gathering to make the*t\n \n*tdeclaration as follows:*t\n *bDeclaration*b *nc[Name of child], we welcome you wholeheartedly to this*nc world. You will do the will of God and receive Jesus Christ as your Lord and Saviour when you come of age. Live to accomplish your purpose and become a blessing to your generation, in the name of Jesus Christ. Amen. *bOption 2:*b \n*tRepresentatives of clergy, family and church will taste the honey on*t\n \n*tbehalf of the gathering and make a declaration together. (This option*t\n \n*tis recommended where the gathering is large).*t\n \n*tThe Officiating Minister shall lead the said representatives to*t\n \n*tdeclare as follows:*t\n *bDeclaration*b *nc[Name of child], we welcome you wholeheartedly to this*nc world. You will do the will of God and receive Jesus Christ as your Lord and Saviour when you come of age. Live to accomplish your purpose and become a blessing to your generation, in the name of Jesus Christ. Amen. "
    },
    {
        "page_number": 17,
        "title": null,
        "content": "*bOption 3:*b \n*tWhere the gathering shall make a declaration without tasting the*t\n \n*thoney.*t\n \n*tThe Officiating Minister shall lead the people gathered to make the*t\n \n*tdeclaration as follows:*t\n *bDeclaration*b \n*t*nc[Name of child], we welcome you wholeheartedly to this world. You*nc*t\n \n*twill do the will of God and receive Jesus Christ as your Lord and*t\n \n*tSaviour when you come of age. Live to accomplish your purpose and*t\n \n*tbecome a blessing to your generation, in the name of Jesus Christ.*t\n \n*tAmen.*t\n *b*b9.      Presentation of Gifts*b*b \n*tThe Officiating Minister shall say:*t\n *bIn Matthew 2:11*b Wise men travelled from the east and presented special gifts of gold, frankincense and myrrh to the baby Jesus. In the same way we encourage friends, family and loved ones gathered here to also present gifts to [name of child].  \n*tThe Minister will invite parents, family and friends who have gifts to present*t\n \n*tthem to the child.*t\n *b*b10.     Word of Appreciation (Optional)*b*b If the parents of the child so desire they may be invited by the Officiating Minister to say a few words of appreciation to all present. (This must be discussed and agreed to before the ceremony commences). *b*b11.    Closing Prayer*b*b \n*tThe Officiating Minister will say the closing prayer to end the ceremony.*t\n *bPrayer*b Thank You, Lord for Your presence with us from the beginning of this ceremony to the end. We ask that You empower the parents, Mr. and Mrs. [last name of parents] with the resources they would need to take care of this child as they instruct and guide him/her in Your Way. "
    },
    {
        "page_number": 18,
        "title": null,
        "content": "*ncLord, bless and sanctify these gifts given to [name of child].*nc May all who gave receive increase according to Your Word which says, “give and it shall be given back unto you; a good measure, pressed down, shaken together and running over, will be poured into your bosom ” (Luke 6:38). As we depart, we ask that Your grace will continue to be with us. Grant us travelling mercies to our various destinations. May Your peace and joy abide in this house, in the Name of our Lord Jesus Christ. Amen. *b12.*b *bBenediction*b \n*tThe officiating Minister shall pronounce the benediction.*t\n *bBenediction*b May the glory of the LORD endure forever; may the LORD rejoice in His works. Now, may the grace of our Lord Jesus Christ, the Love of God and the fellowship of the Holy Spirit be with us all. Amen. "
    },
    {
        "page_number": 19,
        "title": "3.3 CHILD DEDICATION CEREMONY",
        "content": "*b3.3.1 GUIDELINES*b *b1.*b *bIntroduction*b The service for child dedication is first to give thanks to God for the birth of a child, and for the parents to make a solemn promise to provide care, guidance, instruction and discipline for the growth and godly upbringing of the child. At this ceremony the church also receives the child into the fellowship of Christ and pledges to nourish him/her through teaching and the setting of good examples as role models.  The baby Jesus was presented to God at the temple in Jerusalem by His earthly parents [Mathew 2:22]. This act of dedication provides a biblical basis for the dedication of children. By this ceremony parents acknowledge that the child is a gift from God and therefore dedicate themselves to be a godly example to him/her. Dedication does not impart salvation to a child. Salvation comes only through faith in Jesus Christ when the child reaches the age of accountability and accepts Jesus Christ as his/her Lord and Saviour.  The dedication ceremony is a symbolic act of entrusting the child’s life to God’s will. *b2.*b *bGeneral Guidelines*b \na.\t Arrangements for the dedication of the child should be made by\n the Officiating Minister prior to the dedication. \nb. The Officiating Minister should discuss the program with the\n parents so that they will know what is expected of them. 3  \nc. If there are grandparents or godparents participating, this should\n be discussed prior to the ceremony. *b3.3 CHILD DEDICATION CEREMONY*b 3 In cases where there are grandparents or godparents participating in the ceremony, the Officiating Minis- ter should take note and determine which role (if any) they are to play. "
    },
    {
        "page_number": 20,
        "title": null,
        "content": "\nd. Seats should be reserved for the parents, preferably at the front\n row. Seats should also be reserved for grandparents or godparents and other dignitaries who may be present. \ne.\t To minimise ‘baby moments\n 4 ,’ mothers are advised to adequately feed their children prior to the service. \nf. While the guests are taking their seats there should be quiet\n background music which would set the tone for the service. It could be the organist softly playing musical pieces or other selected music. \ng.\t On duty should be a team of smartly dressed ushers to direct guests\n to their seats and to maintain order. Other volunteers required include a praise and worship leader, a sound technician and a church leader to assist the Officiating Minister. \nh.\t A gift table may be set at a space designated for those who have\n gifts for the child (children). \ni. The following are required for the dedication ceremony:\n \ni. The Dedication Certificate, which should be signed, and a\n recent photograph of the child pasted at the right top column. Please note that the Blue Certificates are for boys and the pink ones are for girls. ii.\t A gift from the Church to the child (optional): The recommended gift is “Baby’s First Bible (in pictures),” inscribed with the child’s name. This will aid parents to introduce the Word of God very early in the life of the child. *b3.*b *bDuration of Service*b \na. \t The ceremony should not be unduly lengthy. The maximum time\n recommended is forty-five (45) minutes. 4 Baby Moments is a situation where the baby cries, becomes irritable or mumbling loudly etc. "
    },
    {
        "page_number": 21,
        "title": null,
        "content": "*b*b4.      Child Dedication Ceremony as an Integral part of a Worship*b*b *bService*b \na.\t For this Option the Ceremony will be held after the preaching of\n the Word of God during the Sunday Worship Service. \nb.\t The maximum time recommended for conducting this ceremony is\n fifteen (15) minutes. *b*b5.       Private Ceremony*b*b \na. Where the child dedication ceremony is a private one, it may be\n held at the office of the Officiating Minister, the vestry or a small chapel. The parents are usually alone or accompanied by a few family members and friends. \nb. If it is held in an office or vestry, music ministration may not be\n necessary. *b*b6.       Naming and Dedication of Child in the Church*b*b For this option, the naming and dedication of the child are done together. This option is used when the naming ceremony is held in the church. The maximum time recommended for conducting this ceremony is one (1) hour. "
    },
    {
        "page_number": 22,
        "title": null,
        "content": "*b3.4.2 \t CHILD DEDICATION CEREMONY: Service Devoted*b *b*b *bEntirely for Child Dedication*b *bORDER OF SERVICE*b Opening Prayer Welcome and Introductory Remarks Hymn/Song Opening Remarks Scripture Reading Pledges Prayer of Dedication Presentation of Certificate & Gift Hymn/Song Acknowledgement of Dignitaries Closing Prayer Benediction *b*b1.     Welcome and Introductory Remarks*b*b \n*tThe Officiating Minister shall begin the service by giving a welcome and*t\n \n*tintroductory remark. He/she shall say:*t\n Ladies and gentlemen, we welcome you to this dedication service. This is a happy and significant occasion for us because *nc[names of parents] bring [name of child] before God in solemn*nc dedication. We all join them in giving praise and thanks to the Lord for His goodness and faithfulness. *b*b2.      Opening Prayer*b*b The Officiating Minister shall say the opening prayer thanking God for the child and asking for His presence and blessing upon the ceremony. He/she shall ask all gathered to stand as he/she prays. *bPrayer*b Almighty and everlasting God, unto You we bring praise and thanks for who You are and for what You continue to do in our lives. We are eternally grateful for blessing [Name of Parents] with the precious gift of a child. In the mighty name of Jesus Christ, we ask for Your presence to abide with us throughout this dedication ceremony. Amen. "
    },
    {
        "page_number": 23,
        "title": null,
        "content": "*b*b3.      Hymn/Song*b*b The congregation shall remain standing as the Officiating Minister leads them to sing a hymn or a song, for example To God Be the Glory Great Things He has done; Let Us With A Gladsome Mind or Now Thank We All Our God.” *b*b4.      Invitation of Parents/Grandparents or Godparents to the Altar*b*b \n*tAfter the hymn the Officiating Minister shall invite the parents [and*t\n \n*tgrandparents or godparents of the child, if present) to stand before the altar. The*t\n \n*tchild shall be carried by the father.*t\n \n*tAs the parents (grandparents or godparents, if any) move to the altar, the*t\n \n*torganist softly plays a hymn/song such as*t\n *bJesus Loves the Little Children*b *bor Jesus loves me, this I Know.*b *b*b5.      Opening Remarks*b*b \n*tAs the parents stand facing the Officiating Minister, (with the grandparents or*t\n \n*tgodparents behind them, where applicable), the Officiating Minister shall say:*t\n Children are precious gifts from God given into our care to protect, nurture and train for the glory of God. It is important that all parents observe this obligation. For instance, Hannah recognised that her son Samuel belonged to God and so she brought him to the temple to be dedicated. Mary and Joseph also brought the infant Jesus to the temple to be dedicated unto the Lord. Today, [name of parents] likewise recognise the importance *ncof this duty and present [name of child] to the Lord.  They*nc acknowledge their responsibility to nurture and admonish this child in the Lord. The Church, the living Body of Christ, also has a solemn duty to receive [first name of the child] into the fellowship of Christ, to nourish him/her through teaching and setting good examples as role models. Consequently, this child will grow up knowing the love of Christ through us. "
    },
    {
        "page_number": 24,
        "title": null,
        "content": "*b*b6.      Scripture Reading*b*b \n*tThe Officiating Minister shall read the following Scriptures in Psalm 127:3,*t\n \n*tDeuteronomy 6:6, and Proverbs 22:6:*t\n Behold, children are a heritage from the LORD, the fruit of the womb is a reward 5 . And these words which I command you today shall be in your heart.  You shall teach them diligently to your children, and shall talk of them when you sit in your house, when you walk by the way, when you lie down, and when you rise up. 8 You shall bind them as a sign on your hand, and they shall be as frontlets between your eyes. 9 You shall write them on the doorposts of your house and on your gates 6 . Train up a child in the way he should go, And when he is old he will not depart from it 7 . *b7.*b *bPledges*b *b*b \n*ba.    Pledge of Parents*b\n \n*t*t\n \n*tThe Officiating Minister shall say to the parents:*t\n [Name of parents], God has entrusted this new life into your care. Therefore, it is your duty to raise this child to know and love God. As parents, you are here to present your child to be dedicated to the Lord today. If you are both willing and ready to pledge to bring up your child as admonished by Paul in Ephesians 6:4 “. . . in the training and instruction of the Lord”, then answer “we do” to each of the following questions: \n*tThe Officiating Minister shall then lead the parents (if available, the grandparents*t\n \n*tor godparents), and the congregation to take the following pledges. He/she shall*t\n \n*task them to respond, “We do”, to the pledges.:*t\n 5 Psalm 127:3 6 Deuteronomy 6:6 7 Proverbs 22:6 "
    },
    {
        "page_number": 25,
        "title": null,
        "content": "\n*bi.       Officiating Minister:*b\n By coming forward before God and his people, do you hereby declare your desire to dedicate yourselves and your child to the Lord? *bResponse of Parents:*b We do. *bii.      Officiating Minister:*b Do you present your child to the Lord to be His special possession and to be used for His glory? *bResponse of Parents:*b We do. *biii.    Officiating Minister:*b Do you covenant with God to teach your child the Holy Scriptures and to seek to lead your child to receive Jesus as Saviour and Lord at an early age? *bResponse of Parents:*b We do. *biv.     Officiating Minister:*b Do you dedicate yourself to raise your child with biblical love, instruction and discipline and take him/her to church regularly so that he/she will grow to exhibit the character of Christ? *bResponse of Parents:*b We do \n*bv.      Officiating Minister:*b\n Do you promise to live godly and consistent lives, providing good *ncexamples for [name of child]?*nc *bResponse of Parents:*b We do *bvi.     Officiating Minister:*b *ncDo you promise, with God’s help, to provide [Name of Child]*nc a Christian home of love, peace, security, and give attention, understanding, acceptance, and support for him/her. *bParents:*b We do. *bvii.   Officiating Minister:*b Do you promise, with God’s help, to guide your child to discover their uniqueness and potential and to encourage him/her to pursue his/her passion in life? *bParents:*b We do. "
    },
    {
        "page_number": 26,
        "title": null,
        "content": "*bvii.   Officiating Minister:*b Do you promise to provide, through God’s blessing, the physical, financial, emotional and intellectual needs of your child? *bParents:*b We do. \n*bb.      Pledge of Grandparents or Godparents*b\n \n*tThe Officiating Minister shall lead the grandparents or godparents, if any, to*t\n \n*tsay their pledges:*t\n \n*bi.       Officiating Minister:*b\n Do you promise to live godly and consistent lives, providing good examples for your grandchild/godchild? *bGrandparents or Godparents:*b We do. *bii.      Officiating Minister:*b Do you promise to support this child with your prayers and godly counsel in his/her upbringing? *bGrandparents or Godparents:*b We do. *biii.    Officiating Minister:*b Do you promise, as the godparents/grandparents of this child, to support the parents in prayer, Christian fellowship and godly counsel? *bGrandparents or Godparents:*b We do. \n*bc.       Pledge of Congregation*b\n *bOfficiating Minister to Congregation*b The Officiating Minister shall lead the Congregation to make the following pledge: \n*bi.       Officiating Minister:*b\n *ncDo you promise to support the parents of [name of child] with*nc prayer, Christian fellowship and exhibit godly examples and influence over the life of this child/these children? *bCongregation:*b We do. *b*b8.       Prayer of Dedication*b*b \n*tThe Officiating Minister shall receive the child into his/her arms from the father.*t\n \n*tIn case of an older child, the Officiating Minister shall lay hands upon him/her.*t\n "
    },
    {
        "page_number": 27,
        "title": null,
        "content": "\n*t*bNote:*b*t\n \n*tWhere there is more than one child, such as in the case of twins or triplets,*t\n \n*tthe Officiating Minister shall receive and dedicate each child in turn. However,*t\n \n*twhere there are more than three children, the Officiating Minister shall lay*t\n \n*thands on each of the children and pray over them.*t\n \n*tThe prayer of dedication shall include blessings and protection for the child*t\n . *bPrayer*b Every good and perfect gift comes from the Father, in whom there is no variableness nor shadow of turning. We therefore thank You for the life of this Child. As we present [name of child], we ask that You grant him/her favour and set him/her apart. May You bless and preserve him/her. May You continue to facilitate his/her growth and development. May You purify his/her blood, strengthen his/her bones, and fashion every organ of his/her body to perform to its maximum. May no childhood killer disease affect his/her system. May the Lord *nccause [name of child] to be in excellent health all the days of*nc his/her life and fulfil his/her days on earth. May the Almighty God destroy any plans and evil intentions *nctowards [name of child] and release abundant blessings over*nc him/her to make you great. May God grant to you wisdom from above to enable you to achieve every godly enterprise you undertake. May He cause you to prosper, continue prospering, until you become very prosperous in everything to which you set your hand to do. *ncI dedicate you [name of child] in the Name of the Father, the*nc Son and the Holy Spirit. Amen. \n*tThe Officiating Minister will then hand over the child to the father.*t\n *b*b9.       Presentation of Dedication Certificate and Gift*b*b \n*tThe Officiating Minister shall present the Dedication Certificate to the parents,*t\n \n*twith the words:*t\n I present to you this Dedication Certificate in the name of the Father, the Son and the Holy Spirit. I also present to you this Bible inscribed with the name of your child. From the pages of the Bible, I charge you to instruct *nc[name of child] in the ways of the Lord.*nc "
    },
    {
        "page_number": 28,
        "title": null,
        "content": "*b*b10.     Hymn/Song*b*b \n*tThe Officiating Minister will ask the congregation to stand and sing a song or*t\n \n*thymn such as  O worship the King all glorious above.*t\n *b*b11.     Acknowledgement of Dignitaries*b*b \n*tThe Officiating Minister shall ask the congregation to take their seats while he/*t\n \n*tshe acknowledges dignitaries present at the ceremony.*t\n *b*b12.    Closing Prayer*b*b \n*tThe congregation shall stand as the Officiating Minister says the closing prayer.*t\n *bPrayer*b Our Father, thank You for a successful dedication ceremony. We are confident that You who have began a good thing in *ncthe life of [name of child] will complete it to the glory of Your*nc Name.  We pray for his/her  parents and ask that You continue to bless them with wisdom and all the resources they need to nurture and care for their son/daughter and to bring him/her up to live a godly and responsible life. Thank You also for the lives of all present. We ask that You bless each one and cause Your face to shine upon us. May Your hand be upon us to preserve and keep us all the days of our lives, in the name of our Lord Jesus Christ. Amen. *b*b13.     Benediction*b*b \n*tThe Officiating Minister shall pronounce the benediction.*t\n *bBenediction*b Now may He who is able to do exceedingly abundantly above all that we ask or think, according to the power that works in us, guide and guard your hearts and extend His blessing over you.  To Him be glory in the church by Christ Jesus throughout all ages, world without end. Amen. "
    },
    {
        "page_number": 29,
        "title": null,
        "content": "*b3.5.   NAMING & DEDICATION OF CHILD: In Church*b *b*b *b*b *b*b *bORDER OF SERVICE*b *bPart 1: Child Naming Ceremony*b Opening Prayer Opening Remarks Songs of Praise/Hymn Declaration of Names Naming of the Child Administration of Emblems Prayer (Blessings) Witnessing to the Name *bPart 2: Dedication*b Hymn/Song Opening Statement Prayer of Dedication Presentation of Certificate and Gift Acknowledgement of Dignitaries Closing Prayer Benediction *b3.5.1 \t GUIDELINES*b This ceremony will be in two (2) parts. The first part will be the naming of the child and the second part, the dedication.  This option shall be used where the parents choose to name their child in church.  After the child is named, he/she is then dedicated to the Lord. The church receives the child into the fellowship of Christ and the parents publicly acknowledge their desire and obligation to bring up the child in the fear of the Lord. Dedication does not impart salvation to a child. Salvation comes only through faith that is expressed in Jesus Christ by a person who has attained the age of accountability. "
    },
    {
        "page_number": 30,
        "title": null,
        "content": "*b3.5.2 PART 1: CHILD NAMING CEREMONY*b *b*b1.       Opening Prayer*b*b \n*tThe ceremony will commence with an opening prayer of thanksgiving to God*t\n \n*tfor the gift of life, the blessing of the new-born child and His protection of the*t\n \n*tmother and child through the process of delivery.*t\n *bPrayer*b Our Lord from whom all blessings flow, we thank You for the gift of this bundle of joy. As we begin this ceremony, we acknowledge Your presence. We appreciate You for blessing [name of parents] and taking care of this child from conception to delivery. We ask that You bless and protect him/her from all childhood diseases and all forms of disasters and attacks. We also pray that the potential You have deposited in him/ her will come to fruition so that he/she will grow to be a pillar in this family, church and society.  Thank You for answered prayer, in the Name of Jesus Christ. Amen. *b2.*b *bOpening Remarks*b \n*tThe Officiating Minister welcomes the people present and briefly states the*t\n \n*timportance of the naming ceremony. He/she shall say:*t\n A child is a gift from God. Once a child is born, he/she becomes a member of a family, a community and the Body of Christ (church). It is therefore important to formally welcome and introduce the newly born child to the existing members of the society. The child naming ceremony is conducted to formally welcome a newly born child into the community. It is also an occasion for the parents to publicly announce the names of the child. Names play a very important role in the life of an individual. It has spiritual and social influences on a person. It also sets apart a person from others and identifies that person throughout his/her life. The announcement of the name and purpose of Jesus Christ in *bMatthew 1:21*b helps us to understand the mission of Jesus Christ. Parents should therefore carefully consider the names they choose for their children. "
    },
    {
        "page_number": 31,
        "title": null,
        "content": "*b*b3.     Songs of Praise/Hymn*b*b \n*tThe Officiating Minister shall ask those present to rise and sing songs of praise*t\n \n*tfor a maximum duration of five (5) minutes.*t\n *b*b4.      Declaration of Name(s)*b*b \n*tThe Officiating Minister shall ask the father to rise and stand at the altar facing*t\n \n*tthe congregation.*t\n \n*tThe Officiating Minster shall then address the Father as follows:*t\n *bOfficiating Minister:*b *fn[Name of father], do you have a name for your*fn child? *bFather:*b I do. *bOfficiating Minister:*b In the presence of God and this gathering, please, state the names of your child and explain their meanings. *bFather:*b Ladies and gentlemen, after much prayer the mother and I have chosen the following names for our child… [The father then announces the names to those present and explains the meaning of the names]. \n*tThe Officiating Minister then leads the people to repeat the child’s name thrice.*t\n *b*b5.     Naming of the Child*b*b \n*ba.       Prayer over the Name(s)*b\n \n*tThe Officiating Minister shall pray over the names of the child.*t\n *bPrayer*b Our Heavenly Father, we continue to thank You on this special occasion and for the gift of this child. I commit to You *ncthe names, [names of the child], chosen by his/her parents,*nc and ask that You sanctify these names to be a blessing for this child, in the name of Jesus. Amen. \n*bb.     Conferment of Name(s)*b\n \n*tThe father hands over the child to the Officiating Minister who receives the*t\n \n*tchild into his/her arms.*t\n  "
    },
    {
        "page_number": 32,
        "title": null,
        "content": "\n*tThe Officiating Minister shall confer the name(s) upon the child as follows:*t\n *ncI hereby confer the name [name of the child] upon you in the*nc name of the Father, the Son and the Holy Spirit. I declare that *ncthese names [names of the child] shall be a blessing to you, all*nc the days of your life, in the name of Jesus. Amen. *b*b6.        Administration of Emblems*b*b \n*tAt this point the emblems will be uncovered and made ready to be administered.*t\n  \n*tThe Officiating Minister shall say:*t\n Symbols are part of our Christian ceremonies. We use bread and wine as symbols of Jesus’ Body and Blood, respectively. Also, we view the dove as a symbol representing the Holy Spirit. In this ceremony, water, salt and honey will be used symbolically. \n*ba.      Prayer Over the Emblems*b\n \n*tThe Officiating Minister then prays over the emblems.*t\n  *bPrayer*b Heavenly Father, Creator of all things, we present these emblems to you to sanctify them and make them fit for our use, in the name of Jesus, Amen. \n*tThe Officiating Minister will administer the emblems in the following order:*t\n \n*tWater, salt and honey. He shall then explain the significance of each emblem*t\n \n*twhile administering them to the child.*t\n \n*bb.      Administration of the Water*b\n \n*tThe Minister shall address the gathering as follows, [as he/she lifts up the water*t\n \n*tin the view of the gathering and then places it back in the tray]:*t\n This is water. It represents Life, Purity and the Word of God In *bJohn 7:37-39,*b Jesus likened water to life, saying: “. . . If anyone thirsts, let him come to Me and drink. He who believes in Me, as the Scripture has said, out of his heart will flow rivers of living water.” "
    },
    {
        "page_number": 33,
        "title": null,
        "content": "Water symbolises the Word of God and its importance to life. In *bEphesians 5:26*b the Scriptures state that God sanctifies and cleanses us with the washing of water by His Word. In the same way, this child shall be purified by the Word of God. \n*tThe Officiating Minister then fetches a little water with a teaspoon, places a*t\n \n*tdrop on the tongue of the child, mentions his/her name, and says:*t\n  *nc[Name of child], let the Word of God dwell richly in your life*nc in all wisdom when you come of age and accept Christ as your Lord and Saviour. The Word of God shall set you apart in purity and it shall be a light for your path and a lamp unto your feet. The promises of God in His Word will manifest in your life and make you exceedingly fruitful, in the name of Jesus. Amen. \n*bc.      Administration of Salt*b\n \n*tThe Officiating Minister shall administer the second emblem (salt).*t\n \n*tHe/she shall say,  (as he/she lifts up the salt in the view of the gathering and then*t\n \n*tplaces it back on the tray):*t\n This is salt. It represents character, preservation and influence. *bMatthew 5:13 declares:*b “You are the salt of the earth; but if the salt loses its flavour, how shall it be seasoned? It is then good for nothing but to be thrown out and trampled underfoot by men”. Jesus likened the believer to the salt of the earth. Salt is a preservative, so believers are to preserve the earth from corruption.  Salt also gives flavour and has medicinal value.  As salt is a powerful influence so *ncwe trust that [name of child] will also grow to preserve his/her family,*nc church, society and the world from corruption. \n*tThe Officiating Minister takes a granule of salt with the teaspoon, places it on*t\n \n*tthe tongue of the child and says:*t\n "
    },
    {
        "page_number": 34,
        "title": null,
        "content": "*nc[Name of child] you shall be salt to your generation to*nc preserve righteousness. Just as salt is a preservative so shall your life be preserved from sicknesses, negative influences and all forms of evil. As salt of the earth you will influence your generation through your life, conduct and good deeds, in the name of Jesus. Amen. \n*bd.      Administration of Honey*b\n \n*tThe officiating minister shall administer the third emblem (honey) and shall say*t\n \n*t(as he/she lifts up the honey in the view of the gathering and then places it back*t\n \n*ton the tray):*t\n This is honey. It represents wisdom, industry, and blessing *bProverbs 24:13-14*b reads: “My son [daughter] eat honey because it is good, and the honeycomb which is sweet to your taste; 14 So shall the knowledge of wisdom be to your soul; If you have found it, there is a prospect, And your hope will not be cut off.” *ncToday, it is our expectation that as [Name of Child] tastes this*nc honey, God would bless him/her with wisdom to employ his/ her natural talents and abilities to accomplish great things in his/her lifetime. \n*tThe Officiating Minister takes a small portion of honey with a teaspoon and*t\n \n*tplaces it on the child’s tongue, mentions his/her name and says:*t\n *nc[Name of child], today we ask you to love and seek wisdom*nc from God, and exhibit a sweet spirit in your relationship with everyone all the days of your life. You will be industrious and accomplish great feats in life. The blessings of God will be upon you all the days of your life in the name of Jesus. Amen. *b*b7.      Blessing of the Child*b*b \n*tAfter the child has been named, the Officiating Minister, with the child in his/*t\n \n*ther arms, blesses him/her.*t\n In the case of more than one child, the Officiating Minister will pray for them while they are held in the arms of their parents. "
    },
    {
        "page_number": 35,
        "title": null,
        "content": "*bPrayer/Blessing*b God of all creation and giver of all good and prefect gifts, *ncwe thank You for the life of [name of child]. We ask that*nc you protect, preserve, and provide for his/her physical and spiritual needs as he/she grows before You.  Bless [name of child] with Your favour and a full and satisfying life. *b*b8.      Witnessing to the Name (Attestation)*b*b \n*tWitnessing to the name (attestation) by the witnesses could be done as follows:*t\n *bOption 1:*b \n*tAll witnesses tasting the honey and making a declaration together.*t\n \n*tEach guest at the ceremony will attest to being a witness to the ceremony by*t\n \n*ttasting honey and making a declaration.*t\n \n*tThe Officiating Minister shall lead the gathering to make the declaration as*t\n \n*tfollows:*t\n *bDeclaration*b *nc[Name of child], we welcome you wholeheartedly to this*nc world. You will do the will of God and receive Jesus Christ as your Lord and Saviour when you come of age. Live to accomplish your purpose and become a blessing to your generation, in the name of Jesus Christ. Amen. *bOption 2:*b \n*tRepresentatives of clergy, family and church tasting the honey on behalf of the*t\n \n*tgathering and making a declaration together.*t\n \n*tNote: This option is recommended where the gathering is large.*t\n \n*tThe Officiating Minister shall lead the gathering to make the declaration as*t\n \n*tfollows:*t\n *bDeclaration*b *nc[Name of child] we welcome you wholeheartedly to this*nc world. You will do the will of God and receive Jesus Christ as your Lord and Saviour when you come of age. Live to accomplish your purpose and become a blessing to your generation, in the name of Jesus Christ. Amen. "
    },
    {
        "page_number": 36,
        "title": null,
        "content": "*bOption 3:*b \n*tWhere the gathering will make a declaration without tasting any honey.*t\n \n*tThe Officiating Minister will lead the people gathered to make the declaration*t\n \n*tas follows:*t\n *bDeclaration*b *nc[Name of child], we welcome you wholeheartedly to this*nc world. You will do the will of God and receive Jesus Christ as your Lord and Saviour when you come of age. Live to accomplish your purpose and become a blessing to your generation, in the name of Jesus Christ. "
    },
    {
        "page_number": 37,
        "title": null,
        "content": "*b3.5.3 PART 2: CHILD DEDICATION CEREMONY*b \n*tThe Dedication Service begins with a hymn or a song.*t\n *b*b1.      Hymn/Song:*b*b \n*tThe Officiating Minister shall lead those present to stand and sing a hymn or a*t\n \n*tsong, for example*t\n \n*t*bNow Thank We All Our God, My God How Wonderful*b*t\n \n*t*bThy Art.*b*t\n \n*t(The Minister may select a few stanzas of the hymn).*t\n *b*b2.      Invitation of Parents and Child to the Altar*b*b \n*tAfter the hymn or song, the Officiating Minister shall invite the parents to*t\n \n*tstand before the altar. The child will be carried by the father. As the parents move*t\n \n*tto the altar, the organist softly plays a song such as “Jesus Loves Me” or “Jesus*t\n \n*tLoves the Little Children” in the background.*t\n *b*b3. Opening Statement*b*b \n*tWhile the parents are standing before the altar the Officiating Minister shall*t\n \n*tsay:*t\n Children are precious gifts from God given to parents to nurture, care, protect and train to His glory. Psalm 127:3 states that children are a heritage from the LORD; and the fruit of the womb is a reward. As believers, we recognise this fact and thankfully give back the children to the Lord for His care and protection. In Luke 2:22 Mary and Joseph brought the baby Jesus to the temple in Jerusalem in order to present him before the Lord. In the same way, [name of parents] today present themselves *ncand their child, [name of child] to the Lord.*nc *b*b4.     Pledges*b*b \n*ba.     Pledge of Parents*b\n \n*tThe Officiating Minister shall lead the parents to make the following pledges*t\n \n*tand shall ask them to respond by saying, “We do.”*t\n "
    },
    {
        "page_number": 38,
        "title": null,
        "content": "\n*bi.     Officiating Minister:*b\n By coming forward before God and his people, do you hereby declare your desire to dedicate yourselves and your child to the Lord? *bResponse of Parents:*b We do. *bii.    Officiating Minister:*b Do you present your child to the Lord to be His special possession and to be used for His glory? *bResponse of Parents:*b We do. *biii.    Officiating Minister:*b Do you covenant with God to teach your child the Holy Scriptures and to seek to lead your child to receive Jesus as Saviour and Lord at an early age? *bResponse of Parents:*b We do. *biv.   Officiating Minister:*b Do you dedicate yourself to raise your child with biblical love, instruction and discipline and take him/her to church regularly so that he/she will grow to exhibit the character of Christ? *bResponse of Parents:*b We do \n*bv.    Officiating Minister:*b\n Do you promise to live godly and consistent lives, providing good *ncexamples for [name of child]?*nc *bResponse of Parents:*b We do *bvi.   Officiating Minister:*b *ncDo you promise, with God’s help, to provide [Name of Child] a*nc Christian home of love, peace and security, and give attention, understanding, acceptance, and support for him/her? *bParents:*b We do. *bvii.   Officiating Minister:*b Do you promise, with God’s help, to guide your child to discover his/her uniqueness and potential and to encourage him/her to pursue their passion in life? *bParents:*b We do. "
    },
    {
        "page_number": 39,
        "title": null,
        "content": "*bviii.  Officiating Minister:*b Do you promise to provide, through God’s blessing, the physical, financial, emotional and intellectual needs of your child? *bParents:*b We do. \n*bb.    Pledge of Congregation*b\n *bOfficiating Minister to Congregation*b \n*tThe Officiating Minister shall lead the Congregation to make the following*t\n \n*tpledge:*t\n \n*bi.     Officiating Minister:*b\n Do you promise to support the parents of [name(s) of child] with prayer, Christian fellowship and exhibit godly examples and influence over the life of this child/these children? *bCongregation:*b We do. *b*b5.    Prayer of Dedication*b*b \n*tThe Officiating Minister shall receive the child in his/her arms from the father*t\n \n*tand lay hands upon him (her).*t\n \n*tNote: Where there is more than one child, as in the case of twins, triplets, etc.*t\n \n*tthe parents will bear their children in their arms while the Officiating Minister*t\n \n*tdedicates them.*t\n \n*tThe prayer of dedication shall include blessings and protection for the child.*t\n *bPrayer*b Our Father in heaven, Sustainer of life and Ruler of the *ncuniverse, I dedicate this child  [name of child] into the*nc fellowship of Christ *nc[Name of child],  may you make a personal commitment*nc to our Lord Jesus Christ at an early age and abide in Him throughout your life. May the LORD grant you good health, strengthen your bones and your immune system.  The Lord will keep and protect you from evil and you will live a long and satisfying life. May you grow in wisdom, in stature and in favour with God and men. May you unleash your full potential "
    },
    {
        "page_number": 40,
        "title": null,
        "content": "and fulfil your purpose on earth. I break any ancestral yoke that may hinder your progress and development, and release abundance of blessings that makes one great to affect all your endeavours. May the LORD cause you to prosper a thousand *nctimes more than your parents  I dedicate you [name of child]*nc in the Name of the Father, the Son, and the Holy Spirit. Amen!  \n*tThe Officiating Minister shall then hand over the child to the father.*t\n *b*b6.    Presentation of Dedication Certificate and Gift*b*b \n*tThe Officiating Minister shall present the Dedication Certificate to the mother,*t\n \n*tsaying:*t\n I present to you this Dedication Certificate in the name of the Father, the Son and the Holy Spirit. I also present to you this Bible inscribed with your child’s *ncname. From its pages I charge you to instruct [name of child]*nc in the ways of the Lord. *b*b7.       Closing Prayer*b*b \n*tThe Officiating Minister shall ask all to stand for the closing prayer.*t\n *bPrayer*b Thank You, Lord, for Your presence with us from the beginning of this ceremony to the end. Once again, we give *ncyou thanks for the life of [Name of Child]. We ask that your*nc blessings shall rest upon him/her and guide him/her in the path of truth. We pray also that your divine blessings will rest upon [names of parents]. Grant them wisdom and other resources to fulfil the vows they have made before you. I pray that they will live long to see the fruit of their efforts as the child makes a personal commitment to Christ at an early age. As we depart from here, grant us travel mercies to our various destinations, in the name of Our Lord and Saviour Jesus Christ. Amen. "
    },
    {
        "page_number": 41,
        "title": null,
        "content": "*b*b8. Benediction*b*b \n*tThe Officiating Minister will pronounce the benediction.*t\n *bBenediction*b Now may the Lord bless and keep you. The Lord make His face shine upon you, and be gracious unto you. The Lord lift up His countenance upon you and give you peace. Amen. "
    },
    {
        "page_number": 42,
        "title": "4. RITES OF PASSAGE:",
        "content": "*b4.1 GENERAL GUIDELINES*b *b*b1. Introduction*b*b Rites of passage are conducted in the church to transition children who have been groomed, to the youth church, and the youth to the adult church. This is done to ensure consistent growth and development of children and youth in the church, to be spiritually sensitive to God and morally upright as they grow from stage to stage. It also gives the church the opportunity to acknowledge the development of young persons in their journey of life. There are two rites of passage practiced in the church. The first rite of passage is *bthe Purity Service,*b which transitions the children from the children’s church into the youth church. The second, *bthe Sanctification*b *bService,*b is the transition service from the youth church into the adult church. The first rite of passage is the Purity Service, which transitions the children from the children’s church into the youth church. The second, the Sanctification Service, is the transition service from the youth church into the adult church. Candidates of the purity service are usually twelve (12) years or at the last stage of their primary education. Candidates of the sanctification service are usually fifteen (15) years or at the last stage of their Junior High education. The rites of passage mark the turning point in the life of the children and youth. They are intended to bring an awareness of the knowledge and presence of God in their lives, understand who they are in Christ and birth a desire to witness their faith publicly. They must be growing into responsible believers, fully partaking in the church’s spiritual disciplines. *bNB:*b \n*tThe Rites of Passage may be an integral part of Sunday Worship Service or*t\n \n*theld as a separate service.*t\n *b*b4. RITES OF PASSAGE:*b*b *bCHILDREN AND YOUTH CHURCH*b "
    },
    {
        "page_number": 43,
        "title": null,
        "content": "*b2.*b *bPURITY SERVICE PREPARATION*b *b*b The following are essential preparations needed to have a meaningful and eventful ceremony: \n*ba.      Initial Preparation*b\n \ni.\t The preparation for Purity service should begin when the\n children transition from age eleven (11) or class five (5) and start their journey on their twelfth (12) birthday or class six (6). ii.\t The local church should use one (1) year to consciously prepare to transition the young people from the Children’s church into the Youth church. \n*bb.      Responsibility of the Local Church*b\n The pastor of the local church should engage the facilitators to observe the following biblical instruction and activities: \ni.\t Teach the prescribed topics.\n 9  ii.\t Engage the candidates in activities that encourage practicing spiritual disciplines, including reading of the entire New Testament, scripture memorization, prayer, quiet time, fasting, offering, first fruits and evangelism.  \n*bc.     Communication to Parents/Guardians*b\n \ni.\t The Pastor shall communicate to parents and guardians about\n the dates and activities for the Purity preparation program. ii.\t The Pastor shall inform parents and guardians of the date and dress code for the Purity service. iii.\tParents and guardians should be informed of their obligation to procure the prescribed dress code and ensure that their wards are decently attired for the occasion. They should provide the needed support for their wards through the one-year preparation and endeavor to attend the Purity service. iv. *bAnnouncement:*b The Pastor shall announce the date for the rite of passage in church. The announcement for the service should be made at least two (2) weeks (on each Sunday) to the day of the event. 9 as contained in the ICGC Children’s Policy and Procedures Manual on pages 19 – 21 (pg 12 – 17) "
    },
    {
        "page_number": 44,
        "title": null,
        "content": "v. *bParticipation of Leaders and Parents/Guardians*b All church leaders, parents and guardians of the candidates must be present at the service. *bNB:*b Every child should have an adult figure in their life present at the service. \n*bd.     Itemized Materials and Memorabilia*b\n i. *bBible and Certificate:*b The assembly shall present a bible  and certificate to each child participating in the Purity service. The certificate shall have an appropriate serial numbering by the Regional Office. ii. *bDress Code:*b The dress code shall predominantly have a white theme or a combination of white and other colours. The girls may wear a white dress or a dress with a white theme whereas the boys may wear a white shirt with black trousers. Alternatively, an appropriate African print fabric that is suitable for the service may be used. iii. *bPictures:*b The assembly shall have an official photographer take pictures of the service. It is recommended that the assembly provides copies of the pictures taken by the official photographer to the parents/guardians and their wards. iv. *bRefreshments:*b The assembly shall provide refreshments for the Purity service graduates. \n*be.  Rehearsal for the Rite of Passage:*b\n There shall be a rehearsal (at least a week) before the rite of passage event. The rehearsal takes the children through the actual progression of the service so as to acquaint them with every feature of the service. \n*bf.   Duration:*b\n The ceremony must not exceed twenty (20) minutes. \n*bg.   Seating Arrangements:*b\n Seats should be reserved for the candidates, parents, guardians and any special guests for the service. *b3.*b *bSANCTIFICATION SERVICE PREPARATION*b The following are essential preparations needed to have a meaningful and eventful ceremony: "
    },
    {
        "page_number": 45,
        "title": null,
        "content": "\n*ba. Initial Preparation*b\n \ni. The preparation for Sanctification service should begin when the\n youth attain age fourteen (14) or begin their final year in Junior High School. ii.\t The local church should use one (1) year to consciously prepare to transition the young people from the Youth church into the Adult church. \n*bb.     Responsibility of the Local Church*b\n The pastor of the local church should engage the facilitators to observe the following biblical instruction and activities: \ni.\t Teach the prescribed topics.\n 11 ii.\t Engage the candidates in activities that encourage practicing spiritual discipline, including reading of the entire New Testament, scripture memorization, prayer, quiet time, fasting, offering, first fruits and evangelism. \n*bc.      Communication to Parents/Guardians*b\n \ni.\t The Pastor shall communicate to parents and guardians about the\n dates and activities for the Sanctification preparation program. ii.\t He/she shall inform parents and guardians of the date and dress code for the Sanctification Service. iii.\tParents and guardians should be informed of their obligation to procure the prescribed dress code and ensure that their wards are decently attired for the occasion. They should provide the needed support for their wards throughout the one-year preparation and endeavor to attend the Sanctification service. iv. *bAnnouncement:*b The Pastor shall announce the date for the rite of passage in church. The announcement for the service should be made at least two (2) weeks (on each Sunday) to the day of the event. v. *bParticipation of Leaders and Parents/Guardians:*b All church leaders, parents and guardians of the young ones must be present at the service. *b*b *bNB:*b Every child should have an adult figure in their life present at the service. 11 as contained in the ICGC Youth Ministry Policy and Procedures Manual on pages 12 – 17 "
    },
    {
        "page_number": 46,
        "title": null,
        "content": "\n*bd. Itemized Materials and Memorabilia*b\n i. *bBible and Certificate*b : The assembly shall present a bible  and certificate to each youth participating in the Sanctification service. The certificate shall have an appropriate serial numbering by the Regional Office. ii. *bDress Code:*b The dress code shall have a predominantly white theme or a combination of white and other colours. The girls may wear a white dress or a dress with a white theme whereas the boys may wear a white shirt with black trousers. Alternatively, an appropriate African print fabric that is suitable for the service may be used. iii. *bPictures:*b The assembly shall have an official photographer take pictures for the service. It is recommended that the assembly provides copies of the pictures taken by the official photographer to the Parents/Guardians and their wards. iv. *bRefreshments:*b The assembly shall provide refreshments for the Sanctification service graduates. e. *bRehearsal for the Rite of Passage:*b There shall be a rehearsal (at least a week) before the rite of passage event. The rehearsal takes the children through the actual progression of the service so as to acquaint them with every feature of the service. f. *bDuration:*b The ceremony must not exceed twenty (20) minutes. \ng. Seating Arrangements: Seats should be reserved for the candidates,\n parents, guardians and any special guests for the service. "
    },
    {
        "page_number": 47,
        "title": null,
        "content": "*b4.2*b *bPURITY SERVICE*b *bORDER OF SERVICE*b Opening Prayer Hymn Opening Remarks Word of Exhortation Purity Pledge Parents/Guardians Pledge Remarks and Appreciation Acknowledgement and Announcement Benediction *b*b1.      Opening Prayer*b*b \n*tThe Officiating Minister shall begin the service with prayer. He/she shall ask*t\n \n*tthe congregation to rise.*t\n *bPrayer*b Our Heavenly Father, giver of life and creator of the universe, we thank You for Your lovingkindness and the blessings for this day. We thank You again for the lives of these young ones and for protecting and blessing them. We pray for Your presence at this ceremony. May Your name be glorified in their lives, in Jesus’ name, Amen. *b*b2.      Hymn*b*b The congregation shall remain standing as they sing the congregational hymn. Suggested hymns include: *bA Charge to Keep I Have, Trust and*b *bObey, Take My Life and Let It Be, I’m Pressing on The Upward Way, etc.*b *b*b3.       Opening Remarks*b*b \n*tThe Officiating Minister shall ask the congregation to be seated and shall give*t\n \n*tthe opening remarks:*t\n Pastors, parents, guardians and congregation, we are assembled today in the presence of God to witness the Purity service of [number of candidates] children comprising [number] males and [number] females. This ceremony represents a moment of personal commitment and a significant transition these young ones make today. "
    },
    {
        "page_number": 48,
        "title": null,
        "content": "It is a rite of passage conducted by the church for children aged 12 years, or at their final level of primary education. It is an occasion that marks the transition of these young ones from the Children’s church to the Youth church. Again, it is to bring awareness to these young ones that they have come of age to understand their faith in Jesus Christ and boldly practise and defend it. Scripture enjoins us in Proverbs 22:6 that we should “Train up a child the way he should go and when he is old, he will not depart from it.” It is our prayer that these young ones graduating today into the youth church will not depart from the instruction and training they have received, but rather apply themselves diligently to fulfil their God-given destinies. Our greatest desire is that these children will pattern their lives after that of Jesus Christ and endeavour to teach and raise new disciples for Him. *b*b4.      Word of Exhortation*b*b The officiating Minister shall give a brief exhortation which should not exceed  five (5) minutes. *b*b5.      Purity Pledge*b*b \n*tThe Officiating Minister shall invite the candidates to stand and recite the*t\n \n*tPurity pledge. The Officiating Minister shall say these words:*t\n We are here to witness these young ones take the Purity pledge. The pledge is a reminder of their personal commitment to Jesus Christ, the Church and society. They have fully participated in and completed the required lessons of the Church and are prepared to continue developing their personal relationship with the Lord Jesus Christ. They have been entreated to maintain chastity as expected of every child of God. They are also implored to develop and use their talents and spiritual gifts.  They have therefore been equipped to keep themselves and be ready to serve and influence their society. "
    },
    {
        "page_number": 49,
        "title": null,
        "content": "\n*tThe Officiating Minister shall lead the candidates to say their pledge as follows:*t\n I [Name of candidate], having received Jesus Christ as my Lord and Saviour, and having also received instruction in the Word of God, commit myself to do the following: I will love and serve the Lord my God with all my heart, soul and body. I will keep myself pure and refrain from any immoral behavior. I will tell my friends about the saving power of Jesus Christ. I will make time to serve others with my gifts and talents. I will make time for the church and for fellowship with other Christians. I will endeavor to read my Bible and pray every day. I will imitate the character of Jesus Christ. I will respect and obey my parents in the Lord. I will be faithful to God and always do His will. I make this commitment by faith and trust God for His strength and the help of the Holy Spirit, so help me God. *b*b6.      Parent’s/Guardian’s Pledge*b*b \n*tThe Officiating Minister shall ask the parents and guardians to rise and say*t\n \n*ttheir pledge as follows:*t\n I [name of Parents/Guardians], stand in support of [name(s) of child/children] to commit fully to the Lord Jesus Christ and the Church. I commit myself to do the following for him/her/ them: I will read and study the Bible with him/her/them I will teach him/her/them how to pray and pray with him/ her/them I will live in accordance with God’s word in all righteousness to be an example to him/her/them I will help him/her/them develop God’s gifts and talents given to him/her/them I will not be a hindrance to  him/her/them in his/her/their participation in church activities I will love him/her/them just as Jesus Christ will do in all circumstances. "
    },
    {
        "page_number": 50,
        "title": null,
        "content": "*b*b7. Prayer*b*b \n*tThe Officiating Minister shall pray for the children and Parents/Guardians.*t\n *bPrayer*b Almighty God, we commit these children to You. We ask that You endue them with Your grace, wisdom and all spiritual understanding to walk worthy of You. Guide them to always make the right choices. Preserve them from evil, sicknesses, destruction and bad company. May they excel in their education, be fruitful in every good work, and fulfil their purpose and destiny, in the name of Jesus Christ our Lord. We also commit their parents to Your care, that they will help shape the destinies of these ones. May You bless them with spiritual and material resources, so they will not falter in their assignment. Let these children be an honour to their parents, generation, and those after them, in the name of Jesus Christ, Amen. *b*b8.       Presentation of Certificates and Bibles*b*b \n*tThe Officiating Minister shall present certificates and Bibles to the graduates.*t\n \n*tHe/she shall say these words:*t\n May this certificate be a reminder of the pledge you have made today, and the Bible be the Word of God to guide your life in all things and at all times. *b*b9.      Remarks and Appreciation*b*b One of the graduates shall be selected and prepared to give the appreciation remarks. The person should have shown outstanding character, commitment and service in church and community. The remarks should be written and read by the graduate. *b*b10.     Acknowledgement and Announcement*b*b The Officiating Minister or his/her delegate shall acknowledge all dignitaries present. He/she shall also communicate all the needed information to the congregation, the youth and their parents. The information shall include the recession, pictures and refreshment. "
    },
    {
        "page_number": 51,
        "title": null,
        "content": "*b*b11. Benediction*b*b The Officiating Minister shall pronounce the benediction. *bBenediction*b May Christ dwell in your hearts through faith, that you, being rooted and grounded in love, may have strength to comprehend with all the saints what is the breadth and length and height and depth, and to know the love of Christ that surpasses knowledge, that you may be filled with all the fullness of God. "
    },
    {
        "page_number": 52,
        "title": null,
        "content": "*b4.3 SANCTIFICATION SERVICE*b *bORDER OF SERVICE*b *bOpening Prayer*b Hymn Opening Remarks Word of Exhortation Sanctification Pledge Parents/Guardians Pledge Remarks and Appreciation Acknowledgement and Announcement Benediction *b*b1.      Opening Prayer*b*b \n*tThe Officiating Minister shall begin the service with a prayer. He/she shall ask*t\n \n*tthe congregation to rise.*t\n *bPrayer*b Our Heavenly Father, giver of life and creator of the universe, we thank You for Your lovingkindness and the blessings for this day. We also thank You for the lives of these young ones and for protecting and blessing them. May Your abiding presence continue to be with us in this service. Be glorified even now and forevermore, in Jesus’ name, Amen. *b*b2.       Hymn*b*b \n*tThe congregation shall remain standing as they sing the congregational hymn.*t\n Suggested hymns include: *bA charge to keep I have; Trust and obey;*b *bTake my life, and let it be; I’m pressing on the upward way,*b etc. *b*b3.       Opening Remarks*b*b \n*tThe Officiating Minister shall ask the congregation to be seated and shall give*t\n \n*tthe opening remarks as follows:*t\n Pastors, parents, guardians, and congregation, we are assembled today in the presence of God to witness the Sanctification service of [number of candidates] children comprising [number] males and [number] females. This ceremony represents a moment of personal commitment and a significant transition in the lives of these young ones. "
    },
    {
        "page_number": 53,
        "title": null,
        "content": "This Sanctification service is the rite of passage conducted by the church for teens in the church aged fifteen (15) years, or at the final level of their Junior High School education.  It is an occasion that marks the transition of these youths from the Youth church to the Adult church. Again, it is to bring awareness to these young ones that they have come of age to understand their faith in Jesus Christ and boldly practise and defend it. The scriptures declare in 1 Timothy 4:12: “You are young, but don’t let anyone treat you as if you are not important. Be an example to show the believers how they should live. Show them by what you say, by the way you live, by your love, by your faith, and by your pure life.” (ERV) It is our prayer that these teenagers graduating today into the Adult church will not depart from the instruction and training they have received but rather apply themselves diligently to fulfil their God-given destinies. My greatest desire is that they will pattern their life after that of Jesus Christ and endeavour to teach and raise new disciples for the Lord. *b*b4.      Word of Exhortation*b*b \n*tThe Officiating Minister shall give a brief exhortation which should not exceed*t\n \n*tfive (5) minutes.*t\n *b*b5.      Sanctification Pledge*b*b \n*tThe Officiating Minister shall invite the graduating candidates to stand for the*t\n \n*tSanctification pledge. The Officiating Minister shall say these words:*t\n We are here to witness these teenagers make the Sanctification pledge. The pledge is a reminder of their personal commitment to Jesus Christ, the church and society. They have fully participated in and completed the required lessons of the Church and are prepared to continue developing their personal relationship with the Lord Jesus Christ. They have also been entreated to maintain chastity as expected of every child of God and develop and use their talents and spiritual gifts.  They have therefore been equipped to keep themselves and be ready to serve and influence their society. "
    },
    {
        "page_number": 54,
        "title": null,
        "content": "\n*tThe Officiating Minister shall lead the candidates to say their pledge as follows:*t\n I [Name of Graduate], having received Jesus Christ as my Lord and Saviour, and having also received instruction in the Word of God, commit myself to do the following: I shall love the Lord and keep His charge, His statutes, and His commandments all the days of my life. I shall uphold that which is true, pure, noble, just, lovely and of good report. I shall give myself daily to prayer and the study of the Word of God. The Word of God shall be my guide and Jesus Christ shall continually be my model for Christian living. I promise to make myself and my resources available for the use of my Lord and Master Jesus Christ and for the good of humankind. I promise to engage myself fully in the development of my spiritual gifts and natural abilities through continuous education. I commit myself to live as Christ lived, love as He loved and serve as He served. I pledge to be a humble servant of the Lord to serve my church, the community, the nation, and the world. I shall commit myself to the sharing of the Word of God to all people. I promise to honor God, my parents, leaders, and my friends in all my dealings. I promise to stay focused and be ready at all times for the second coming of our Lord Jesus Christ. I make these commitments by faith and trust God for his strength and the power of the Holy Spirit, in Jesus’ name, Amen. *b*b6.      Parents/Guardians Pledge*b*b \n*tThe Officiating Minister shall ask the parents and guardians to rise and say*t\n \n*ttheir pledge as follows:*t\n "
    },
    {
        "page_number": 55,
        "title": null,
        "content": "I [Name of Parents/Guardian], stand in support of [name(s) of child/children] to commit fully to the Lord Jesus Christ and the Church. I commit myself to do the following for him/her/ them: I will mentor him/her/them in spiritual development through fellowship and studying of the Bible. I will inspire him/her/them unto spiritual growth through prayer and waiting on God. I will live in accordance with God’s word in all righteousness to be an example to him/her/them. I will help him/her/them to develop God’s gifts and talents and put them to service. I will not be a hindrance through ungodly decisions and choices but inspire him/her/them to love Jesus Christ and grow in Him. I will love him/her/them just as Jesus Christ would do in all circumstances. *b*b7.       Prayer*b*b \n*tThe Officiating Minister shall pray for the Youth and Parents/Guardians.*t\n *bPrayer*b Our Father, we commit these young adults to Your grace and ask that You fill them with wisdom and spiritual understanding to walk in chastity and purpose. Guide them to always make the right choices. Preserve them from evil, sicknesses, destruction and bad company. May they excel in their education, be fruitful in every good work, and fulfil their destiny, in the name of Jesus Christ. We also commit their parents to Your care, that they will help shape the destinies of these ones. May You bless them with spiritual and material resources to be able to fend for these ones. Let these young adults become a blessing to their families, the Church and humanity, in the name of Jesus Christ. Amen. *b*b8.      Presentation of Certificates and Bibles*b*b \n*tThe Officiating Minister shall present certificates and Bibles to the graduates.*t\n \n*tThe Officiating Minister shall say these words:*t\n "
    },
    {
        "page_number": 56,
        "title": null,
        "content": "May this certificate be a reminder of the pledge you have made today, and the Bible be the Word of God to guide your life in all things and at all times. *b*b9.      Remarks and Appreciation*b*b One of the graduates shall be selected and prepared to give the appreciation remarks. The person should have shown outstanding character, commitment and service in church and community. The remarks should be written and read by the graduate. *b*b10.    Acknowledgement and Announcement*b*b The Officiating Minister or his/her delegate shall acknowledge all dignitaries present. He/she shall also communicate all the needed information to the congregation, the youth and their parents. The information shall include the recession, pictures and refreshment. *b*b11.    Benediction*b*b The officiating minister shall pronounce the benediction. He shall ask the congregation to stand. *bBenediction*b He who is the blessed and only Sovereign, the King of kings and Lord of lords, who alone has immortality, who dwells in unapproachable light, whom no one has ever seen or can see. To Him be honour and eternal dominion. Amen. "
    },
    {
        "page_number": 57,
        "title": "5.  FORMS",
        "content": "*b5.1 CHILD NAMING CEREMONY – REQUEST FORM*b *bCHILD NAMING CEREMONY*b *bREQUEST FORM*b *bMOTHER’S INFORMATION*b FIRST NAME ………………………….........................................................… SURNAME ……………………………............................................................. OTHER NAMES …………………………………..................………………. AGE ………..        NATIONALITY ……….............………………………… OCCUPATION ………..................................…TEL…………………....…… EMAIL…………………………………………….............…………………… RESIDENCE:   CITY/TOWN……......……….… OUNTRY………………. MARITAL STATUS:  PLEASE TICK WEDDED  CUSTOMARILY  NOT PROPERLY MARRIED *bFATHER’S INFORMATION*b FIRST NAME ………………………………………………….....................… SURRNME……………………………………………………………..........… OTHER NAMES ……………………………………………………...……… AGE…………  NATIONALITY…………………….......…………………… OCCUPATION…………………….....………TEL ….……………………… EMAIL…………………………………………………………………….....… RESIDENCE: CITY/TOWN…………………… COUNTRY……………… MARITAL STATUS:  PLEASE TICK WEDDED  *b*b5.  FORMS*b*b "
    },
    {
        "page_number": 58,
        "title": null,
        "content": "CUSTOMARILY NOT PROPERLY MARRIED *bCHILD’S INFORMATION*b PROPOSED NAME FIRST NAME ……………………..............................….…………………….. SURNAME………………………………..............…………………………… OTHER NAMES ……………………………………………...................…… GENDER Male               \t    Female DATE OF BIRTH ………………………………………………..................… PLACE OF BIRTH …………………………………………………................ NAME OF HOSPITAL ………………………………............................…… BIRTH CERTIFICATE NO …………………………………......................… *bCHILD NAMING CEREMONY INFORMATION*b DATE ………………………………………………………………..........…… TIME ……………………….......................................................................…… VENUE …………………………………………………………………........... DIRECTIONS TO THE LOCATION OF THE CEREMONY: …………………………………………………………………………………. ………………………………………………………………………………….. ………………………………………………………………………………….. ………………………………………………………………………………….. *bADDITIONAL INFORMATION FOR PARENTS*b *b*b Parents should ensure that: \ni. A CHILD NAMIMG REQUEST FORM is filled and submitted.\n ii. The form is submitted not later than one (1) week before the naming ceremony. "
    },
    {
        "page_number": 59,
        "title": null,
        "content": "iii.\tThe following Emblems are provided for the Naming Ceremony:  • *bSALT*b *b*b - Matthew 5:13  • *bWATER*b   - Ephesians 5:26  • *bHONEY*b   - Psalm 19:10 iv.\tThe Family should be seated before the ceremony commences. *bAll Parents are to strictly adhere to the requirements stated above.*b Note: Kindly fill and submit this form at the front desk. For Further enquiries, call +000 000 000 000, Mondays - Fridays (9am-5pm) [Email address]   [Website] ==================================================== *bOFFICIAL USE ONLY*b DATE …………………………………….... TIME ………..........…………… CONFIRMATION OF DATE & TIME ……………………………………... OFFICIATING MINISTER………………..............…………………………. "
    },
    {
        "page_number": 60,
        "title": null,
        "content": "*b5.2 CHILD DEDICATION – REQUEST FORM*b *bCHILD DEDICATION*b *bREQUEST FORM*b *bMOTHER’S INFORMATION*b FIRST NAME ………………………….........................................................… SURNAME ……………………………............................................................. OTHER NAMES …………………………………..................………………. AGE ………..        NATIONALITY ……….............………………………… OCCUPATION ………..................................…TEL…………………....…… EMAIL…………………………………………….............…………………… RESIDENCE:   CITY/TOWN……......……….… OUNTRY………………. MARITAL STATUS:  PLEASE TICK WEDDED  CUSTOMARILY  NOT PROPERLY MARRIED *bFATHER’S INFORMATION*b FIRST NAME ………………………………………………….....................… SURRNME……………………………………………………………..........… OTHER NAMES ……………………………………………………...……… AGE…………  NATIONALITY…………………….......…………………… OCCUPATION…………………….....………TEL ….……………………… EMAIL…………………………………………………………………….....… RESIDENCE: CITY/TOWN…………………… COUNTRY……………… MARITAL STATUS:  PLEASE TICK WEDDED  CUSTOMARILY NOT PROPERLY MARRIED "
    },
    {
        "page_number": 61,
        "title": null,
        "content": "*bBABY’S INFORMATION*b FIRST NAME ……………………..............................….…………………….. SURNAME………………………………..............…………………………… OTHER NAMES ……………………………………………...................…… GENDER Male               \t      Female DATE OF BIRTH ………………………………………………..................… PLACE OF BIRTH …………………………………………………................ NAME OF HOSPITAL ………………………………............................…… BIRTH CERTIFICATE NO …………………………………......................… *bCEREMONY INFORMATION*b Date of Ceremony:  ………………………………….................................….. Time of Ceremony: …………...............................................................……… Venue of Ceremony: ………………………………………………………….. The Family should be seated by: ………........................................………… \n*tA Dedication Certificate and Bible will be given to the child*t\n *bREQUIREMENTS FOR PARENTS*b Parents should ensure that: • A CHILD DEDICATION REQUEST FORM is filled and submitted • The form is submitted not later than 2 weeks before the Dedication Service • Parents should submit Child’s photograph (contact church office for more information) *bAll Parents are to Strictly Adhere to the requirements stated above.*b Note: Kindly fill and submit this form at the front desk or designated office. For Further enquiries, Mondays - Fridays (10am-5pm) Email: "
    },
    {
        "page_number": 62,
        "title": null,
        "content": "*bOFFICIAL USE ONLY*b DATE OF DEDICATION: ………………............…………………………… DEDICATION CERTIFICATE NO: ……………………………................… PLACE OF DEDICATION: …………………………………….............….… OFFICIATING MINISTER: …………………………………………………. SIGN: …………………………………………………….....................………. . "
    },
    {
        "page_number": 63,
        "title": "6. BENEDICTION SCRIPTURES",
        "content": "1. *b1.\t“The LORD bless you and keep you; The LORD make His face*b shine upon you, and be gracious to you; The LORD lift up His countenance upon you, And give you peace.” *b(Numbers 6:24-26)*b 2. Now may the God of peace who brought up our Lord Jesus from the dead, that great Shepherd of the sheep, through the blood of the everlasting covenant, make you complete in every good work to do His will, working in you what is well pleasing in His sight, through Jesus Christ, to whom be glory forever and ever. Amen. *b(Hebrews*b *b13:20-21)*b 3. Now may the God of patience and comfort grant you to be like- minded toward one another, according to Christ Jesus, that you may, with one mind and one mouth, glorify the God and Father of our Lord Jesus Christ. *b(Romans 15:5-6)*b 4. Now may the God of peace  Himself sanctify you completely, and may your whole spirit and soul and body be kept blameless at the coming of our Lord Jesus Christ. He who calls you is faithful;  He will surely do it. *b(1 Thess. 5:23-24 )*b 5. Now may our Lord Jesus Christ Himself, and God our Father, who loved us and gave us eternal comfort and good hope through grace, comfort your hearts and establish you in every good work and word. *b(2 Thess. 2:16-17 )*b 6. May the God of hope fill you with all joy and peace in believing, so that by the power of the Holy Spirit you may abound in hope. *b(Romans 15:13)*b 7. May God give you heaven’s dew and earth’s richness— an abundance of grain and new wine. *b(Genesis 27:28)*b 8. The grace of the Lord Jesus Christ and the love of God and the fellowship of the Holy Spirit be with you all. *b(2 Corinthians 13:14)*b *b*b6.    BENEDICTION SCRIPTURES*b*b "
    },
    {
        "page_number": 64,
        "title": null,
        "content": "9. Grace, mercy, and peace from God the Father and Christ Jesus our Lord. *b(2Timothy 1:2)*b *b10.\t The grace of the Lord Jesus Christ be with your spirit.*b *b(Philemon 25)*b *b11.\t Grace to you and peace from God our Father and the Lord Jesus*b Christ. *b(Philemon 3)*b *b12.\t  Grace and peace be multiplied to you in the knowledge of God and*b of Jesus our Lord. *b(2 Peter 1:2)*b *b13.\t The grace of the Lord Jesus be with all. Amen.*b *b(Revelation 22:21)*b *b14.\t The grace of our Lord Jesus Christ be with you all. Amen.*b *b(Romans*b *b16: 24)*b *b15.\t  Grace to you and peace from God our Father and the Lord Jesus*b Christ. *b(1 Corinthians 1:3)*b *b16.  Brethren, the grace of our Lord Jesus Christ be with your spirit.*b Amen. *b(Galatians 6:18)*b *b17. Grace, mercy, and peace will be with you from God the Father and*b from the Lord Jesus Christ, the Son of the Father, in truth and love. *b*b *b(2 John 3)*b *b18. Peace be to the brothers, and love with faith, from God the Father*b and the Lord Jesus Christ. Grace be with all who love our Lord Jesus Christ with love incorruptible. *b(Ephesians 6:23-24)*b *b19.\t Now to him who is able to do far more abundantly than all that we*b ask or think, according to the power at work within us, to him be glory in the church and in Christ Jesus throughout all generations, forever and ever. Amen. *b(Ephesians 3:20-21)*b *b20. Now to Him who is able to keep you from stumbling, And to present*b you faultless Before the presence of His glory with exceeding joy, To God our Savior, Who alone is wise, Be glory and majesty, Dominion and power, both now and forever. Amen. *b(Jude 24-25)*b *b21.\t Now to him who is able to keep you from stumbling and to present*b "
    },
    {
        "page_number": 65,
        "title": null,
        "content": "you blameless before the presence of his glory with great joy, to the only God, our Savior, through Jesus Christ our Lord, be glory, majesty, dominion, and authority, before all time and now and forever. Amen. *b(Jude 24-25)*b *b22. Now to the King eternal, immortal, invisible, to God who alone is*b wise, be honor and glory forever and ever. Amen. *b(1 Timothy 1:17)*b *b23.\t To him who loves us and has freed us from our sins by his blood*b and made us a kingdom, priests to his God and Father, to him be glory and dominion forever and ever. Amen. *b(Revelation 1:5b-6)*b *b24.\t Blessing and glory and wisdom and thanksgiving and honor and*b power and might be to our God forever and ever! Amen. *b(Revelation*b *b7:12)*b *b25. And God is able to bless you abundantly, so that in all things at*b all times, having all that you need, you will abound in every good work. *b(2 Corinthians 9:8)*b *b26. To the King of ages, immortal, invisible, the only God, be honor and*b glory forever and ever. Amen. *b(1 Timothy 1:17)*b *b27. He who is the blessed and only Sovereign, the King of kings and Lord*b of lords, who alone has immortality, who dwells in unapproachable light, whom no one has ever seen or can see. To him be honor and eternal dominion. Amen. *b(1 Timothy 6:15b-16)*b *b28. Worthy is the Lamb who was slain, to receive power and wealth*b and wisdom and might and honor and glory and blessing! …To him who sits on the throne and to the Lamb be blessing and honor and glory and might forever and ever! *b(Revelation 5:12, 13)*b "
    }
]