[
    {
        "title": "ICGC MISSIONS COMMON FUND  POLICY ON THE ICGC MISSIONS COMMON FUND",
        "coverImageUrl": "",
        "totalPage": 11,
        "pages": [
            {
                "page_number": 2,
                "title": "CONTENTS",
                "content": "CONTENTS   1.  PREAMBLE .................................................................................................................................... 2 2.  INSTITUTION OF THE MISSIONS COMMON FUND ............................................................................ 3 *b2.1*b  *bB*b *bACKGROUND*b .......................................................................................................................... 3 *b2.2*b  *bD*b *bEFINITION*b *b(W*b *bHAT IS*b *bM*b *bISSIONS*b *bC*b *bOMMON*b *bF*b *bUND*b *b)*b ......................................................................... 3 *b2.3*b  *bI*b *bMPORTANCE*b *b(W*b *bHY*b *bS*b *bHOULD*b *bA*b *bSSEMBLIES*b *bP*b *bAY*b *bM*b *bISSIONS*b *bC*b *bOMMON*b *bF*b *bUND*b *b)*b ........................................ 3 *b2.4*b  *bE*b *bLIGIBILITY*b  *bFOR*b *bP*b *bAYMENTS*b *b(W*b *bHO*b *bS*b *bHOULD*b *bP*b *bAY*b *bMCF)*b ...................................................................... 3 *b2.5*b  *bP*b *bERIOD OF*b *bP*b *bAYMENTS*b *b(W*b *bHEN*b *bS*b *bHOULD*b *bMCF*b *b*b *bB*b *bE*b *bP*b *bAID*b *b)*b ....................................................................... 4 *b2.6*b  *bM*b *bODE OF*b *bP*b *bAYMENT*b *b(H*b *bOW*b *bT*b *bO*b *bP*b *bAY*b *bM*b *bISSIONS*b *bC*b *bOMMON*b *bF*b *bUND*b *b)*b ........................................................ 4 3.  DEFAULTING ................................................................................................................................. 5 *b3.1*b  *bW*b *bHAT*b *bC*b *bONSTITUTES*b *bD*b *bEFAULTING*b ............................................................................................... 5 4.  MCF SANCTIONS COMMITTEE ........................................................................................................ 6 4  PROVISION FOR REDRESS .............................................................................................................. 8 5.1  *bP*b *bROCEDURE FOR*b *bR*b *bEDRESS*b *b:*b ......................................................................................................... 8              "
            },
            {
                "page_number": 3,
                "title": "PREAMBLE",
                "content": "1.  PREAMBLE The International Central Gospel Church (ICGC) is a non-profit making organization and is funded by offerings and other donations through its local assemblies.  The Church has established that all such inflows must be accounted for from the assemblies by clear financial procedures and directly regulated by the policies on financial management (i.e. the Financial Management Procedures Manual).  The Presbytery has directed that all assemblies should pay a stipulated percentage of First Fruits received at the local Assembly as \n*tMissions Common Fund (MCF)*t\n payments to the Head Office, to support the church’s administration, missions and any other developments. The MCF is therefore the local assembly’s main financial contribution to the Church.  All ICGC assemblies are expected to adhere to its payment faithfully, regularly and timeously.  This policy document has been developed in recognition of the need for a single, documented reference guide for the establishment and contribution to the MCF.  It also sets out the sanctions and procedures for applying same with regards to the Fund.  This policy document addresses the following:  i.  Provide a reference guide that ensures uniformity and standardization in the way churches calculate and pay their MCF. ii.  Serve as a reference manual to assist new ICGC assemblies and staff become familiar with the MCF.   "
            },
            {
                "page_number": 4,
                "title": "INSTITUTION OF THE MISSIONS COMMON FUND",
                "content": "2.  INSTITUTION OF THE MISSIONS COMMON FUND *b*b *b2.1*b *bB*b *bACKGROUND*b *b*b The Presbytery of the Church established the MCF to ensure a regular source of funding for the running of the Church through its Head Office. The MCF payment is the local assemblies’ main financial obligation towards the Church.  All ICGC assemblies shall therefore be committed to its payment as set out by this policy.   *b2.2*b *bD*b *bEFINITION*b *b(W*b *bHAT IS*b *bM*b *bISSIONS*b *bC*b *bOMMON*b *bF*b *bUND*b *b)*b The MCF is a mandatory payment of a percentage of the total receivables of the First Fruit from each local assembly in every month.  The amount payable is defined in percentages to ensure equity and fairness across all ICGC assemblies worldwide.  The existing percentage as at the time of the writing of this policy is twenty percent (20%) of the total receivables of the First Fruit from each local assembly in every month.  The Presbytery of the Church by its mandate, however, reserves the right to review the exact percentage to be paid as MCF from time to time and shall indicate same in writing to all assemblies for compliance.  *b2.3*b *bI*b *bMPORTANCE*b *b(W*b *bHY*b *bS*b *bHOULD*b *bA*b *bSSEMBLIES*b *bP*b *bAY*b *bM*b *bISSIONS*b *bC*b *bOMMON*b *bF*b *bUND*b *b)*b *b*b *b*b The MCF is the single reliable source of fund for the implementation of the vision and mission of the ICGC agenda. Thus, its payment is the most compelling evidence of an assembly’s membership of the ICGC brand and its non-payment undermines the collective effort of the church to attain its ideals and objectives. *b*b *b2.4*b *bE*b *bLIGIBILITY*b  *bFOR*b *bP*b *bAYMENTS*b *b(W*b *bHO*b *bS*b *bHOULD*b *bP*b *bAY*b *bMCF)*b   i.  Every ICGC assembly shall pay the mandatory percentage of its monthly First Fruit as MCF to the Head Office. ii.  The payment start from the very moment an assembly is established and First Fruit is taken. iii.  The Pastor of the assembly is directly responsible for the payment of the MCF. "
            },
            {
                "page_number": 5,
                "title": null,
                "content": "*b*b *b2.5*b *bP*b *bERIOD OF*b *bP*b *bAYMENTS*b *b(W*b *bHEN*b *bS*b *bHOULD*b *bMCF*b *b*b *bB*b *bE*b *bP*b *bAID*b *b)*b   i.  All assemblies should make their MCF payments on a monthly basis. ii.  MCF should be paid in the ensuing week that First Fruit is received. iii.  Payments of each month’s MCF should not go beyond the *b14*b *bth*b *bday*b of the month of collection; a.  For example, the MCF for the month of January should be paid out of the January First Fruits receipts, which is collected on the first Sunday in February, and should be paid latest the 14 th of February. iv.  MCF on the remaining First Fruits collected for the rest of that month should be added to the main receivable in the next month. a.  For example, MCF should be calculated on the remaining First Fruits collected in the 2 nd  to 4 th week of January, and paid together with the February MCF which should be paid by the 14 th of March. v.  Payments should be accompanied by the properly filled Returns Sheet \n*t(attached as*t\n \n*tAppendix 1).*t\n   *b2.6*b *bM*b *bODE OF*b *bP*b *bAYMENT*b *b(H*b *bOW*b *bT*b *bO*b *bP*b *bAY*b *bM*b *bISSIONS*b *bC*b *bOMMON*b *bF*b *bUND*b *b)*b *b*b *b*b MCF shall be paid directly to the ICGC Head Office located on the Central University campus in Miotso, Prampram.   Alternatively, MCF payments can be made into an ICGC Head Office designated account and evidence of the payment sent to the Head Office either electronically or via postal service.   "
            },
            {
                "page_number": 6,
                "title": "DEFAULTING",
                "content": "3.  DEFAULTING  *b3.1*b *bW*b *bHAT*b *bC*b *bONSTITUTES*b *bD*b *bEFAULTING*b *b*b The term “Default” in relation to the payment of the MCF refers to any of the following: i.  *bNon-Payment:*b Failure by an ICGC assembly to pay the obligatory MCF by the due date, i.e. the 14 th day of the next month 1 .   ii.  *bUnderpayment:*b The under declaration of the monthly First Fruit received by an ICGC assembly with the clear intention to influence the amount to be paid which may result in the underpayment of the MCF.  Underpayment is considered a very serious offence because it is an act of dishonesty.      1 There was an earlier point on delayed payments which has been deleted because it is also perceived as non-payment. "
            },
            {
                "page_number": 7,
                "title": "MCF SANCTIONS COMMITTEE",
                "content": "4.  MCF SANCTIONS COMMITTEE 4.1.  To ensure that sanctions are administered fairly and effectively, the General Overseer (GO) shall constitute a five-member MCF Standing Committee (hereafter referred to as ‘Sanctions Committee’), chaired by his assigned representative who shall be directly responsible for enforcing the sanctions contained in this document through the Head Office. 4.2.  The Sanctions Committee’s exclusive objective is to ensure that the MCF is regularly paid to the Head office, and payment is made on schedule, failure by which sanctions are applied. 4.3.  Mandate of the Sanctions Committee i.  Receive monthly MCF payments report from the Finance and Audit department through the General Secretary (GS) or his appointed officer. ii.  Schedule monthly meetings for the review of the MCF payments report. iii.  Write a preliminary report to the GO through the GS indicating the state of affairs of the payment of the MCF. iv.  Identify defaulters of the MCF. v.  Recommend sanctions as stipulated by the policy regulating the payments of the MCF to the GO for action to be taken against defaulters.  4.4.  Sanctions The sanctions outlined in this policy are set as preventive measures and signify the importance of meeting all financial obligations for the effective running of the Church. These sanctions are considered as both corrective and punitive measures. The following procedures shall apply to all MCF defaulters:  4.4.1  A query shall be issued in writing by the chair of the Sanctions Committee in consultation with the GS to the pastor of the defaulting church within a week of the deadline for the payment of the MCF. 4.4.2  The pastor shall respond in writing to the chair of the Sanctions Committee within seven days of receiving the letter indicating the reasons for defaulting. 4.4.3  If the Sanctions Committee deems the response unsatisfactory, necessary and appropriate punitive action shall be considered. This shall be taken depending on the "
            },
            {
                "page_number": 8,
                "title": null,
                "content": "gravity of the offence and may include any of the punitive/corrective measures stated below ( \n*tsee,*t\n 4.3.4). 4.4.4  Punitive/Corrective Measures i.  *bQuery:*b A query shall be issued to a pastor who is a first time defaulter of the payment of the MCF in accordance with the schedule date for all payment. Queries are only considered once for the same offence. This shall not be applied in situations where the offence has to do with underpayment of the MCF. In such cases, a graver punitive action is required even if it is a first time offence. ii.  *bWarning:*b A written warning letter shall be issued to a pastor for defaulting on MCF payments (more than once) and have previously been queried but remain persistent in delayed payments of the MCF. A written letter indicating a harsher punitive action that may include but not limited to his/her suspension from pastoral duties shall warn the defaulter. iii.  *bSuspension:*b A pastor may be suspended from pastoral duties for defaulting on the payments on the MCF or underpayment of same.  A pastor on suspension: a.  Shall not be allowed to preach in his/her assembly or any other church (including those outside Ghana) during the period. b.  Pastors who hold any supervisory position or function on any church agency or committee shall be withdrawn from their positions until such a time that they may be restored and reconsidered for such positions. c.  Deliberate understatement and therefore underpayment of the MCF is a grievous offence and will therefore not attract a warning.  The least severe punishment will be the suspension of the offending pastor. d.  Upon resumption from suspension, such a pastor shall be made to sign an undertaking to pay his/her MCF truthfully, promptly and regularly. iv.  *bDemotion*b : A pastor who after serving his/her suspension, continues to default in payment or underpayment of MCF, shall be withdrawn from his/her assembly.  He/she shall be relocated to another assembly less privileged, or he/she may be asked to start a new ICGC branch. *bDismissal*b :  A pastor who consistently defaults in payment of Missions Common Fund may be relieved of his position as a pastor and dismissed. "
            },
            {
                "page_number": 9,
                "title": "PROVISION FOR REDRESS",
                "content": "4  PROVISION FOR REDRESS  5.1 *bP*b *bROCEDURE FOR*b *bR*b *bEDRESS*b *b:*b  If for any reason a Pastor feels the Sanctions Committee has not treated him/her fairly, the following procedure shall be followed for redress:  i.  Write to the GO, with a copy to the GS to make a case for redress.  ii.  The letter should include the decision of the Sanctions Committee as well as the process taken and should clearly state why the decision by the Sanctions Committee is considered unfair.  iii.  The GO may set up an ad hoc committee to review the processes and decision of the Sanctions Committee and present its findings to him.  iv.  The GO shall then make a final decision with regards to the issues raised, which will be considered binding on all parties involved.   *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b *b*b "
            },
            {
                "page_number": 10,
                "title": "INTERNATIONAL CENTRAL GOSPEL CHURCH (ICGC) - HEAD OFFICE",
                "content": "*b*b *b*b *bForm A2*b INTERNATIONAL CENTRAL GOSPEL CHURCH (ICGC) - HEAD OFFICE  *bMISSIONS COMMON FUND (MCF) PAYMENT FORM*b   Month: ________________________________  Year:  20_ _  *bASSEMBLY INFORMATION:*b Name of Assembly: ________________________________________ Town: _________________ District: __________________________________  Region: ______________________  *bFIRST FRUIT RECEIVED:*b *bDETAILS*b *bAMOUNT*b *b(¢)*b *bAMOUNT*b *b($)*b *bAMOUNT*b *b(£)*b *bAMOUNT*b *b(OTHERS)*b *bINDICATE CURRENCY*b *bTOTALS*b Week 1      Week 2     Week 3     Week 4     Week 5     Cedi (¢) Equivalent    TOTALS      20% MCF       *bPAYMENTS:*b Cheque No: ____________________________________________________ (Cedi Cheques) Cheque No: ____________________________________________________ (Foreign Currency) Name of Administrator: _____________________________________ Signature: ______________ Name of Pastor: ___________________________________________ Signature: ______________ Prepared by: ______________________________________________ Phone #: _______________ Date:  __________________ *b*b *bNOTE:  PLEASE ATTACH YOUR MONTHLY RETURNS (FORM A1)*b *b*b "
            }
        ]
    }
]